Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD1TXQSTAbits_t CFD1TXQSTAbits __asm__ ("CFD1TXQSTA") __attribute__((section("sfrs"), address(0xBF880150)));
extern volatile uint32_t        CFD1TXQSTACLR __attribute__((section("sfrs"),address(0xBF880154)));
extern volatile uint32_t        CFD1TXQSTASET __attribute__((section("sfrs"),address(0xBF880158)));
extern volatile uint32_t        CFD1TXQSTAINV __attribute__((section("sfrs"),address(0xBF88015C)));
#define CFD1TXQUA CFD1TXQUA
extern volatile uint32_t   CFD1TXQUA __attribute__((section("sfrs"), address(0xBF880160)));
typedef struct {
  uint32_t TXQUA:32;
} __CFD1TXQUAbits_t;
extern volatile __CFD1TXQUAbits_t CFD1TXQUAbits __asm__ ("CFD1TXQUA") __attribute__((section("sfrs"), address(0xBF880160)));
extern volatile uint32_t        CFD1TXQUACLR __attribute__((section("sfrs"),address(0xBF880164)));
extern volatile uint32_t        CFD1TXQUASET __attribute__((section("sfrs"),address(0xBF880168)));
extern volatile uint32_t        CFD1TXQUAINV __attribute__((section("sfrs"),address(0xBF88016C)));
#define CFD1FIFOCON1 CFD1FIFOCON1
extern volatile uint32_t   CFD1FIFOCON1 __attribute__((section("sfrs"), address(0xBF880170)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON1bits_t;
extern volatile __CFD1FIFOCON1bits_t CFD1FIFOCON1bits __asm__ ("CFD1FIFOCON1") __attribute__((section("sfrs"), address(0xBF880170)));
extern volatile uint32_t        CFD1FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF880174)));
extern volatile uint32_t        CFD1FIFOCON1SET __attribute__((section("sfrs"),address(0xBF880178)));
extern volatile uint32_t        CFD1FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88017C)));
#define CFD1FIFOSTA1 CFD1FIFOSTA1
extern volatile uint32_t   CFD1FIFOSTA1 __attribute__((section("sfrs"), address(0xBF880180)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA1bits_t;
extern volatile __CFD1FIFOSTA1bits_t CFD1FIFOSTA1bits __asm__ ("CFD1FIFOSTA1") __attribute__((section("sfrs"), address(0xBF880180)));
extern volatile uint32_t        CFD1FIFOSTA1CLR __attribute__((section("sfrs"),address(0xBF880184)));
extern volatile uint32_t        CFD1FIFOSTA1SET __attribute__((section("sfrs"),address(0xBF880188)));
extern volatile uint32_t        CFD1FIFOSTA1INV __attribute__((section("sfrs"),address(0xBF88018C)));
#define CFD1FIFOUA1 CFD1FIFOUA1
extern volatile uint32_t   CFD1FIFOUA1 __attribute__((section("sfrs"), address(0xBF880190)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA1bits_t;
extern volatile __CFD1FIFOUA1bits_t CFD1FIFOUA1bits __asm__ ("CFD1FIFOUA1") __attribute__((section("sfrs"), address(0xBF880190)));
extern volatile uint32_t        CFD1FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF880194)));
extern volatile uint32_t        CFD1FIFOUA1SET __attribute__((section("sfrs"),address(0xBF880198)));
extern volatile uint32_t        CFD1FIFOUA1INV __attribute__((section("sfrs"),address(0xBF88019C)));
#define CFD1FIFOCON2 CFD1FIFOCON2
extern volatile uint32_t   CFD1FIFOCON2 __attribute__((section("sfrs"), address(0xBF8801A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON2bits_t;
extern volatile __CFD1FIFOCON2bits_t CFD1FIFOCON2bits __asm__ ("CFD1FIFOCON2") __attribute__((section("sfrs"), address(0xBF8801A0)));
extern volatile uint32_t        CFD1FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8801A4)));
extern volatile uint32_t        CFD1FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8801A8)));
extern volatile uint32_t        CFD1FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8801AC)));
#define CFD1FIFOSTA2 CFD1FIFOSTA2
extern volatile uint32_t   CFD1FIFOSTA2 __attribute__((section("sfrs"), address(0xBF8801B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA2bits_t;
extern volatile __CFD1FIFOSTA2bits_t CFD1FIFOSTA2bits __asm__ ("CFD1FIFOSTA2") __attribute__((section("sfrs"), address(0xBF8801B0)));
extern volatile uint32_t        CFD1FIFOSTA2CLR __attribute__((section("sfrs"),address(0xBF8801B4)));
extern volatile uint32_t        CFD1FIFOSTA2SET __attribute__((section("sfrs"),address(0xBF8801B8)));
extern volatile uint32_t        CFD1FIFOSTA2INV __attribute__((section("sfrs"),address(0xBF8801BC)));
#define CFD1FIFOUA2 CFD1FIFOUA2
extern volatile uint32_t   CFD1FIFOUA2 __attribute__((section("sfrs"), address(0xBF8801C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA2bits_t;
extern volatile __CFD1FIFOUA2bits_t CFD1FIFOUA2bits __asm__ ("CFD1FIFOUA2") __attribute__((section("sfrs"), address(0xBF8801C0)));
extern volatile uint32_t        CFD1FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8801C4)));
extern volatile uint32_t        CFD1FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8801C8)));
extern volatile uint32_t        CFD1FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8801CC)));
#define CFD1FIFOCON3 CFD1FIFOCON3
extern volatile uint32_t   CFD1FIFOCON3 __attribute__((section("sfrs"), address(0xBF8801D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON3bits_t;
