Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD2FLTCON1bits_t CFD2FLTCON1bits __asm__ ("CFD2FLTCON1") __attribute__((section("sfrs"), address(0xBF881750)));
extern volatile uint32_t        CFD2FLTCON1CLR __attribute__((section("sfrs"),address(0xBF881754)));
extern volatile uint32_t        CFD2FLTCON1SET __attribute__((section("sfrs"),address(0xBF881758)));
extern volatile uint32_t        CFD2FLTCON1INV __attribute__((section("sfrs"),address(0xBF88175C)));
#define CFD2FLTCON2 CFD2FLTCON2
extern volatile uint32_t   CFD2FLTCON2 __attribute__((section("sfrs"), address(0xBF881760)));
typedef struct {
  uint32_t F8BP:5;
  uint32_t :2;
  uint32_t FLTEN8:1;
  uint32_t F9BP:5;
  uint32_t :2;
  uint32_t FLTEN9:1;
  uint32_t F10BP:5;
  uint32_t :2;
  uint32_t FLTEN10:1;
  uint32_t F11BP:5;
  uint32_t :2;
  uint32_t FLTEN11:1;
} __CFD2FLTCON2bits_t;
extern volatile __CFD2FLTCON2bits_t CFD2FLTCON2bits __asm__ ("CFD2FLTCON2") __attribute__((section("sfrs"), address(0xBF881760)));
extern volatile uint32_t        CFD2FLTCON2CLR __attribute__((section("sfrs"),address(0xBF881764)));
extern volatile uint32_t        CFD2FLTCON2SET __attribute__((section("sfrs"),address(0xBF881768)));
extern volatile uint32_t        CFD2FLTCON2INV __attribute__((section("sfrs"),address(0xBF88176C)));
#define CFD2FLTCON3 CFD2FLTCON3
extern volatile uint32_t   CFD2FLTCON3 __attribute__((section("sfrs"), address(0xBF881770)));
typedef struct {
  uint32_t F12BP:5;
  uint32_t :2;
  uint32_t FLTEN12:1;
  uint32_t F13BP:5;
  uint32_t :2;
  uint32_t FLTEN13:1;
  uint32_t F14BP:5;
  uint32_t :2;
  uint32_t FLTEN14:1;
  uint32_t F15BP:5;
  uint32_t :2;
  uint32_t FLTEN15:1;
} __CFD2FLTCON3bits_t;
extern volatile __CFD2FLTCON3bits_t CFD2FLTCON3bits __asm__ ("CFD2FLTCON3") __attribute__((section("sfrs"), address(0xBF881770)));
extern volatile uint32_t        CFD2FLTCON3CLR __attribute__((section("sfrs"),address(0xBF881774)));
extern volatile uint32_t        CFD2FLTCON3SET __attribute__((section("sfrs"),address(0xBF881778)));
extern volatile uint32_t        CFD2FLTCON3INV __attribute__((section("sfrs"),address(0xBF88177C)));
#define CFD2FLTCON4 CFD2FLTCON4
extern volatile uint32_t   CFD2FLTCON4 __attribute__((section("sfrs"), address(0xBF881780)));
typedef struct {
  uint32_t F16BP:5;
  uint32_t :2;
  uint32_t FLTEN16:1;
  uint32_t F17BP:5;
  uint32_t :2;
  uint32_t FLTEN17:1;
  uint32_t F18BP:5;
  uint32_t :2;
  uint32_t FLTEN18:1;
  uint32_t F19BP:5;
  uint32_t :2;
  uint32_t FLTEN19:1;
} __CFD2FLTCON4bits_t;
extern volatile __CFD2FLTCON4bits_t CFD2FLTCON4bits __asm__ ("CFD2FLTCON4") __attribute__((section("sfrs"), address(0xBF881780)));
extern volatile uint32_t        CFD2FLTCON4CLR __attribute__((section("sfrs"),address(0xBF881784)));
extern volatile uint32_t        CFD2FLTCON4SET __attribute__((section("sfrs"),address(0xBF881788)));
extern volatile uint32_t        CFD2FLTCON4INV __attribute__((section("sfrs"),address(0xBF88178C)));
#define CFD2FLTCON5 CFD2FLTCON5
extern volatile uint32_t   CFD2FLTCON5 __attribute__((section("sfrs"), address(0xBF881790)));
typedef struct {
  uint32_t F20BP:5;
  uint32_t :2;
  uint32_t FLTEN20:1;
  uint32_t F21BP:5;
  uint32_t :2;
  uint32_t FLTEN21:1;
  uint32_t F22BP:5;
  uint32_t :2;
  uint32_t FLTEN22:1;
  uint32_t F23BP:5;
  uint32_t :2;
  uint32_t FLTEN23:1;
} __CFD2FLTCON5bits_t;
extern volatile __CFD2FLTCON5bits_t CFD2FLTCON5bits __asm__ ("CFD2FLTCON5") __attribute__((section("sfrs"), address(0xBF881790)));
extern volatile uint32_t        CFD2FLTCON5CLR __attribute__((section("sfrs"),address(0xBF881794)));
extern volatile uint32_t        CFD2FLTCON5SET __attribute__((section("sfrs"),address(0xBF881798)));
extern volatile uint32_t        CFD2FLTCON5INV __attribute__((section("sfrs"),address(0xBF88179C)));
#define CFD2FLTCON6 CFD2FLTCON6
extern volatile uint32_t   CFD2FLTCON6 __attribute__((section("sfrs"), address(0xBF8817A0)));
typedef struct {
  uint32_t F24BP:5;
  uint32_t :2;
  uint32_t FLTEN24:1;
  uint32_t F25BP:5;
  uint32_t :2;
  uint32_t FLTEN25:1;
  uint32_t F26BP:5;
  uint32_t :2;
  uint32_t FLTEN26:1;
  uint32_t F27BP:5;
  uint32_t :2;
  uint32_t FLTEN27:1;
} __CFD2FLTCON6bits_t;
extern volatile __CFD2FLTCON6bits_t CFD2FLTCON6bits __asm__ ("CFD2FLTCON6") __attribute__((section("sfrs"), address(0xBF8817A0)));
extern volatile uint32_t        CFD2FLTCON6CLR __attribute__((section("sfrs"),address(0xBF8817A4)));
extern volatile uint32_t        CFD2FLTCON6SET __attribute__((section("sfrs"),address(0xBF8817A8)));
extern volatile uint32_t        CFD2FLTCON6INV __attribute__((section("sfrs"),address(0xBF8817AC)));
#define CFD2FLTCON7 CFD2FLTCON7
extern volatile uint32_t   CFD2FLTCON7 __attribute__((section("sfrs"), address(0xBF8817B0)));
typedef struct {
  uint32_t F28BP:5;
  uint32_t :2;
  uint32_t FLTEN28:1;
  uint32_t F29BP:5;
  uint32_t :2;
  uint32_t FLTEN29:1;
  uint32_t F30BP:5;
  uint32_t :2;
  uint32_t FLTEN30:1;
  uint32_t F31BP:5;
  uint32_t :2;
  uint32_t FLTEN31:1;
} __CFD2FLTCON7bits_t;
extern volatile __CFD2FLTCON7bits_t CFD2FLTCON7bits __asm__ ("CFD2FLTCON7") __attribute__((section("sfrs"), address(0xBF8817B0)));
extern volatile uint32_t        CFD2FLTCON7CLR __attribute__((section("sfrs"),address(0xBF8817B4)));
extern volatile uint32_t        CFD2FLTCON7SET __attribute__((section("sfrs"),address(0xBF8817B8)));
extern volatile uint32_t        CFD2FLTCON7INV __attribute__((section("sfrs"),address(0xBF8817BC)));
#define CFD2FLTOBJ0 CFD2FLTOBJ0
extern volatile uint32_t   CFD2FLTOBJ0 __attribute__((section("sfrs"), address(0xBF8817C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ0bits_t;
extern volatile __CFD2FLTOBJ0bits_t CFD2FLTOBJ0bits __asm__ ("CFD2FLTOBJ0") __attribute__((section("sfrs"), address(0xBF8817C0)));
extern volatile uint32_t        CFD2FLTOBJ0CLR __attribute__((section("sfrs"),address(0xBF8817C4)));
extern volatile uint32_t        CFD2FLTOBJ0SET __attribute__((section("sfrs"),address(0xBF8817C8)));
extern volatile uint32_t        CFD2FLTOBJ0INV __attribute__((section("sfrs"),address(0xBF8817CC)));
#define CFD2MASK0 CFD2MASK0
extern volatile uint32_t   CFD2MASK0 __attribute__((section("sfrs"), address(0xBF8817D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK0bits_t;
extern volatile __CFD2MASK0bits_t CFD2MASK0bits __asm__ ("CFD2MASK0") __attribute__((section("sfrs"), address(0xBF8817D0)));
extern volatile uint32_t        CFD2MASK0CLR __attribute__((section("sfrs"),address(0xBF8817D4)));
extern volatile uint32_t        CFD2MASK0SET __attribute__((section("sfrs"),address(0xBF8817D8)));
extern volatile uint32_t        CFD2MASK0INV __attribute__((section("sfrs"),address(0xBF8817DC)));
#define CFD2FLTOBJ1 CFD2FLTOBJ1
extern volatile uint32_t   CFD2FLTOBJ1 __attribute__((section("sfrs"), address(0xBF8817E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ1bits_t;
extern volatile __CFD2FLTOBJ1bits_t CFD2FLTOBJ1bits __asm__ ("CFD2FLTOBJ1") __attribute__((section("sfrs"), address(0xBF8817E0)));
extern volatile uint32_t        CFD2FLTOBJ1CLR __attribute__((section("sfrs"),address(0xBF8817E4)));
extern volatile uint32_t        CFD2FLTOBJ1SET __attribute__((section("sfrs"),address(0xBF8817E8)));
extern volatile uint32_t        CFD2FLTOBJ1INV __attribute__((section("sfrs"),address(0xBF8817EC)));
#define CFD2MASK1 CFD2MASK1
extern volatile uint32_t   CFD2MASK1 __attribute__((section("sfrs"), address(0xBF8817F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK1bits_t;
extern volatile __CFD2MASK1bits_t CFD2MASK1bits __asm__ ("CFD2MASK1") __attribute__((section("sfrs"), address(0xBF8817F0)));
extern volatile uint32_t        CFD2MASK1CLR __attribute__((section("sfrs"),address(0xBF8817F4)));
extern volatile uint32_t        CFD2MASK1SET __attribute__((section("sfrs"),address(0xBF8817F8)));
extern volatile uint32_t        CFD2MASK1INV __attribute__((section("sfrs"),address(0xBF8817FC)));
#define CFD2FLTOBJ2 CFD2FLTOBJ2
extern volatile uint32_t   CFD2FLTOBJ2 __attribute__((section("sfrs"), address(0xBF881800)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ2bits_t;
extern volatile __CFD2FLTOBJ2bits_t CFD2FLTOBJ2bits __asm__ ("CFD2FLTOBJ2") __attribute__((section("sfrs"), address(0xBF881800)));
extern volatile uint32_t        CFD2FLTOBJ2CLR __attribute__((section("sfrs"),address(0xBF881804)));
extern volatile uint32_t        CFD2FLTOBJ2SET __attribute__((section("sfrs"),address(0xBF881808)));
extern volatile uint32_t        CFD2FLTOBJ2INV __attribute__((section("sfrs"),address(0xBF88180C)));
#define CFD2MASK2 CFD2MASK2
extern volatile uint32_t   CFD2MASK2 __attribute__((section("sfrs"), address(0xBF881810)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK2bits_t;
extern volatile __CFD2MASK2bits_t CFD2MASK2bits __asm__ ("CFD2MASK2") __attribute__((section("sfrs"), address(0xBF881810)));
extern volatile uint32_t        CFD2MASK2CLR __attribute__((section("sfrs"),address(0xBF881814)));
extern volatile uint32_t        CFD2MASK2SET __attribute__((section("sfrs"),address(0xBF881818)));
extern volatile uint32_t        CFD2MASK2INV __attribute__((section("sfrs"),address(0xBF88181C)));
#define CFD2FLTOBJ3 CFD2FLTOBJ3
extern volatile uint32_t   CFD2FLTOBJ3 __attribute__((section("sfrs"), address(0xBF881820)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ3bits_t;
extern volatile __CFD2FLTOBJ3bits_t CFD2FLTOBJ3bits __asm__ ("CFD2FLTOBJ3") __attribute__((section("sfrs"), address(0xBF881820)));
extern volatile uint32_t        CFD2FLTOBJ3CLR __attribute__((section("sfrs"),address(0xBF881824)));
extern volatile uint32_t        CFD2FLTOBJ3SET __attribute__((section("sfrs"),address(0xBF881828)));
extern volatile uint32_t        CFD2FLTOBJ3INV __attribute__((section("sfrs"),address(0xBF88182C)));
#define CFD2MASK3 CFD2MASK3
extern volatile uint32_t   CFD2MASK3 __attribute__((section("sfrs"), address(0xBF881830)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK3bits_t;
extern volatile __CFD2MASK3bits_t CFD2MASK3bits __asm__ ("CFD2MASK3") __attribute__((section("sfrs"), address(0xBF881830)));
extern volatile uint32_t        CFD2MASK3CLR __attribute__((section("sfrs"),address(0xBF881834)));
extern volatile uint32_t        CFD2MASK3SET __attribute__((section("sfrs"),address(0xBF881838)));
extern volatile uint32_t        CFD2MASK3INV __attribute__((section("sfrs"),address(0xBF88183C)));
#define CFD2FLTOBJ4 CFD2FLTOBJ4
extern volatile uint32_t   CFD2FLTOBJ4 __attribute__((section("sfrs"), address(0xBF881840)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ4bits_t;
extern volatile __CFD2FLTOBJ4bits_t CFD2FLTOBJ4bits __asm__ ("CFD2FLTOBJ4") __attribute__((section("sfrs"), address(0xBF881840)));
extern volatile uint32_t        CFD2FLTOBJ4CLR __attribute__((section("sfrs"),address(0xBF881844)));
extern volatile uint32_t        CFD2FLTOBJ4SET __attribute__((section("sfrs"),address(0xBF881848)));
extern volatile uint32_t        CFD2FLTOBJ4INV __attribute__((section("sfrs"),address(0xBF88184C)));
#define CFD2MASK4 CFD2MASK4
extern volatile uint32_t   CFD2MASK4 __attribute__((section("sfrs"), address(0xBF881850)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK4bits_t;
extern volatile __CFD2MASK4bits_t CFD2MASK4bits __asm__ ("CFD2MASK4") __attribute__((section("sfrs"), address(0xBF881850)));
extern volatile uint32_t        CFD2MASK4CLR __attribute__((section("sfrs"),address(0xBF881854)));
extern volatile uint32_t        CFD2MASK4SET __attribute__((section("sfrs"),address(0xBF881858)));
extern volatile uint32_t        CFD2MASK4INV __attribute__((section("sfrs"),address(0xBF88185C)));
#define CFD2FLTOBJ5 CFD2FLTOBJ5
extern volatile uint32_t   CFD2FLTOBJ5 __attribute__((section("sfrs"), address(0xBF881860)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ5bits_t;
extern volatile __CFD2FLTOBJ5bits_t CFD2FLTOBJ5bits __asm__ ("CFD2FLTOBJ5") __attribute__((section("sfrs"), address(0xBF881860)));
extern volatile uint32_t        CFD2FLTOBJ5CLR __attribute__((section("sfrs"),address(0xBF881864)));
extern volatile uint32_t        CFD2FLTOBJ5SET __attribute__((section("sfrs"),address(0xBF881868)));
extern volatile uint32_t        CFD2FLTOBJ5INV __attribute__((section("sfrs"),address(0xBF88186C)));
#define CFD2MASK5 CFD2MASK5
extern volatile uint32_t   CFD2MASK5 __attribute__((section("sfrs"), address(0xBF881870)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK5bits_t;
