Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD2MASK19bits_t CFD2MASK19bits __asm__ ("CFD2MASK19") __attribute__((section("sfrs"), address(0xBF881A30)));
extern volatile uint32_t        CFD2MASK19CLR __attribute__((section("sfrs"),address(0xBF881A34)));
extern volatile uint32_t        CFD2MASK19SET __attribute__((section("sfrs"),address(0xBF881A38)));
extern volatile uint32_t        CFD2MASK19INV __attribute__((section("sfrs"),address(0xBF881A3C)));
#define CFD2FLTOBJ20 CFD2FLTOBJ20
extern volatile uint32_t   CFD2FLTOBJ20 __attribute__((section("sfrs"), address(0xBF881A40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ20bits_t;
extern volatile __CFD2FLTOBJ20bits_t CFD2FLTOBJ20bits __asm__ ("CFD2FLTOBJ20") __attribute__((section("sfrs"), address(0xBF881A40)));
extern volatile uint32_t        CFD2FLTOBJ20CLR __attribute__((section("sfrs"),address(0xBF881A44)));
extern volatile uint32_t        CFD2FLTOBJ20SET __attribute__((section("sfrs"),address(0xBF881A48)));
extern volatile uint32_t        CFD2FLTOBJ20INV __attribute__((section("sfrs"),address(0xBF881A4C)));
#define CFD2MASK20 CFD2MASK20
extern volatile uint32_t   CFD2MASK20 __attribute__((section("sfrs"), address(0xBF881A50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK20bits_t;
extern volatile __CFD2MASK20bits_t CFD2MASK20bits __asm__ ("CFD2MASK20") __attribute__((section("sfrs"), address(0xBF881A50)));
extern volatile uint32_t        CFD2MASK20CLR __attribute__((section("sfrs"),address(0xBF881A54)));
extern volatile uint32_t        CFD2MASK20SET __attribute__((section("sfrs"),address(0xBF881A58)));
extern volatile uint32_t        CFD2MASK20INV __attribute__((section("sfrs"),address(0xBF881A5C)));
#define CFD2FLTOBJ21 CFD2FLTOBJ21
extern volatile uint32_t   CFD2FLTOBJ21 __attribute__((section("sfrs"), address(0xBF881A60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ21bits_t;
extern volatile __CFD2FLTOBJ21bits_t CFD2FLTOBJ21bits __asm__ ("CFD2FLTOBJ21") __attribute__((section("sfrs"), address(0xBF881A60)));
extern volatile uint32_t        CFD2FLTOBJ21CLR __attribute__((section("sfrs"),address(0xBF881A64)));
extern volatile uint32_t        CFD2FLTOBJ21SET __attribute__((section("sfrs"),address(0xBF881A68)));
extern volatile uint32_t        CFD2FLTOBJ21INV __attribute__((section("sfrs"),address(0xBF881A6C)));
#define CFD2MASK21 CFD2MASK21
extern volatile uint32_t   CFD2MASK21 __attribute__((section("sfrs"), address(0xBF881A70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK21bits_t;
extern volatile __CFD2MASK21bits_t CFD2MASK21bits __asm__ ("CFD2MASK21") __attribute__((section("sfrs"), address(0xBF881A70)));
extern volatile uint32_t        CFD2MASK21CLR __attribute__((section("sfrs"),address(0xBF881A74)));
extern volatile uint32_t        CFD2MASK21SET __attribute__((section("sfrs"),address(0xBF881A78)));
extern volatile uint32_t        CFD2MASK21INV __attribute__((section("sfrs"),address(0xBF881A7C)));
#define CFD2FLTOBJ22 CFD2FLTOBJ22
extern volatile uint32_t   CFD2FLTOBJ22 __attribute__((section("sfrs"), address(0xBF881A80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ22bits_t;
extern volatile __CFD2FLTOBJ22bits_t CFD2FLTOBJ22bits __asm__ ("CFD2FLTOBJ22") __attribute__((section("sfrs"), address(0xBF881A80)));
extern volatile uint32_t        CFD2FLTOBJ22CLR __attribute__((section("sfrs"),address(0xBF881A84)));
extern volatile uint32_t        CFD2FLTOBJ22SET __attribute__((section("sfrs"),address(0xBF881A88)));
extern volatile uint32_t        CFD2FLTOBJ22INV __attribute__((section("sfrs"),address(0xBF881A8C)));
#define CFD2MASK22 CFD2MASK22
extern volatile uint32_t   CFD2MASK22 __attribute__((section("sfrs"), address(0xBF881A90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK22bits_t;
extern volatile __CFD2MASK22bits_t CFD2MASK22bits __asm__ ("CFD2MASK22") __attribute__((section("sfrs"), address(0xBF881A90)));
extern volatile uint32_t        CFD2MASK22CLR __attribute__((section("sfrs"),address(0xBF881A94)));
extern volatile uint32_t        CFD2MASK22SET __attribute__((section("sfrs"),address(0xBF881A98)));
extern volatile uint32_t        CFD2MASK22INV __attribute__((section("sfrs"),address(0xBF881A9C)));
#define CFD2FLTOBJ23 CFD2FLTOBJ23
extern volatile uint32_t   CFD2FLTOBJ23 __attribute__((section("sfrs"), address(0xBF881AA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ23bits_t;
extern volatile __CFD2FLTOBJ23bits_t CFD2FLTOBJ23bits __asm__ ("CFD2FLTOBJ23") __attribute__((section("sfrs"), address(0xBF881AA0)));
extern volatile uint32_t        CFD2FLTOBJ23CLR __attribute__((section("sfrs"),address(0xBF881AA4)));
extern volatile uint32_t        CFD2FLTOBJ23SET __attribute__((section("sfrs"),address(0xBF881AA8)));
extern volatile uint32_t        CFD2FLTOBJ23INV __attribute__((section("sfrs"),address(0xBF881AAC)));
#define CFD2MASK23 CFD2MASK23
extern volatile uint32_t   CFD2MASK23 __attribute__((section("sfrs"), address(0xBF881AB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK23bits_t;
extern volatile __CFD2MASK23bits_t CFD2MASK23bits __asm__ ("CFD2MASK23") __attribute__((section("sfrs"), address(0xBF881AB0)));
extern volatile uint32_t        CFD2MASK23CLR __attribute__((section("sfrs"),address(0xBF881AB4)));
extern volatile uint32_t        CFD2MASK23SET __attribute__((section("sfrs"),address(0xBF881AB8)));
extern volatile uint32_t        CFD2MASK23INV __attribute__((section("sfrs"),address(0xBF881ABC)));
#define CFD2FLTOBJ24 CFD2FLTOBJ24
extern volatile uint32_t   CFD2FLTOBJ24 __attribute__((section("sfrs"), address(0xBF881AC0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ24bits_t;
extern volatile __CFD2FLTOBJ24bits_t CFD2FLTOBJ24bits __asm__ ("CFD2FLTOBJ24") __attribute__((section("sfrs"), address(0xBF881AC0)));
extern volatile uint32_t        CFD2FLTOBJ24CLR __attribute__((section("sfrs"),address(0xBF881AC4)));
extern volatile uint32_t        CFD2FLTOBJ24SET __attribute__((section("sfrs"),address(0xBF881AC8)));
extern volatile uint32_t        CFD2FLTOBJ24INV __attribute__((section("sfrs"),address(0xBF881ACC)));
#define CFD2MASK24 CFD2MASK24
extern volatile uint32_t   CFD2MASK24 __attribute__((section("sfrs"), address(0xBF881AD0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK24bits_t;
extern volatile __CFD2MASK24bits_t CFD2MASK24bits __asm__ ("CFD2MASK24") __attribute__((section("sfrs"), address(0xBF881AD0)));
extern volatile uint32_t        CFD2MASK24CLR __attribute__((section("sfrs"),address(0xBF881AD4)));
extern volatile uint32_t        CFD2MASK24SET __attribute__((section("sfrs"),address(0xBF881AD8)));
extern volatile uint32_t        CFD2MASK24INV __attribute__((section("sfrs"),address(0xBF881ADC)));
#define CFD2FLTOBJ25 CFD2FLTOBJ25
extern volatile uint32_t   CFD2FLTOBJ25 __attribute__((section("sfrs"), address(0xBF881AE0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ25bits_t;
extern volatile __CFD2FLTOBJ25bits_t CFD2FLTOBJ25bits __asm__ ("CFD2FLTOBJ25") __attribute__((section("sfrs"), address(0xBF881AE0)));
extern volatile uint32_t        CFD2FLTOBJ25CLR __attribute__((section("sfrs"),address(0xBF881AE4)));
extern volatile uint32_t        CFD2FLTOBJ25SET __attribute__((section("sfrs"),address(0xBF881AE8)));
extern volatile uint32_t        CFD2FLTOBJ25INV __attribute__((section("sfrs"),address(0xBF881AEC)));
#define CFD2MASK25 CFD2MASK25
extern volatile uint32_t   CFD2MASK25 __attribute__((section("sfrs"), address(0xBF881AF0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK25bits_t;
extern volatile __CFD2MASK25bits_t CFD2MASK25bits __asm__ ("CFD2MASK25") __attribute__((section("sfrs"), address(0xBF881AF0)));
extern volatile uint32_t        CFD2MASK25CLR __attribute__((section("sfrs"),address(0xBF881AF4)));
extern volatile uint32_t        CFD2MASK25SET __attribute__((section("sfrs"),address(0xBF881AF8)));
extern volatile uint32_t        CFD2MASK25INV __attribute__((section("sfrs"),address(0xBF881AFC)));
#define CFD2FLTOBJ26 CFD2FLTOBJ26
extern volatile uint32_t   CFD2FLTOBJ26 __attribute__((section("sfrs"), address(0xBF881B00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ26bits_t;
extern volatile __CFD2FLTOBJ26bits_t CFD2FLTOBJ26bits __asm__ ("CFD2FLTOBJ26") __attribute__((section("sfrs"), address(0xBF881B00)));
extern volatile uint32_t        CFD2FLTOBJ26CLR __attribute__((section("sfrs"),address(0xBF881B04)));
extern volatile uint32_t        CFD2FLTOBJ26SET __attribute__((section("sfrs"),address(0xBF881B08)));
extern volatile uint32_t        CFD2FLTOBJ26INV __attribute__((section("sfrs"),address(0xBF881B0C)));
#define CFD2MASK26 CFD2MASK26
extern volatile uint32_t   CFD2MASK26 __attribute__((section("sfrs"), address(0xBF881B10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK26bits_t;
extern volatile __CFD2MASK26bits_t CFD2MASK26bits __asm__ ("CFD2MASK26") __attribute__((section("sfrs"), address(0xBF881B10)));
extern volatile uint32_t        CFD2MASK26CLR __attribute__((section("sfrs"),address(0xBF881B14)));
extern volatile uint32_t        CFD2MASK26SET __attribute__((section("sfrs"),address(0xBF881B18)));
extern volatile uint32_t        CFD2MASK26INV __attribute__((section("sfrs"),address(0xBF881B1C)));
#define CFD2FLTOBJ27 CFD2FLTOBJ27
extern volatile uint32_t   CFD2FLTOBJ27 __attribute__((section("sfrs"), address(0xBF881B20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ27bits_t;
extern volatile __CFD2FLTOBJ27bits_t CFD2FLTOBJ27bits __asm__ ("CFD2FLTOBJ27") __attribute__((section("sfrs"), address(0xBF881B20)));
extern volatile uint32_t        CFD2FLTOBJ27CLR __attribute__((section("sfrs"),address(0xBF881B24)));
extern volatile uint32_t        CFD2FLTOBJ27SET __attribute__((section("sfrs"),address(0xBF881B28)));
extern volatile uint32_t        CFD2FLTOBJ27INV __attribute__((section("sfrs"),address(0xBF881B2C)));
#define CFD2MASK27 CFD2MASK27
extern volatile uint32_t   CFD2MASK27 __attribute__((section("sfrs"), address(0xBF881B30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK27bits_t;
extern volatile __CFD2MASK27bits_t CFD2MASK27bits __asm__ ("CFD2MASK27") __attribute__((section("sfrs"), address(0xBF881B30)));
extern volatile uint32_t        CFD2MASK27CLR __attribute__((section("sfrs"),address(0xBF881B34)));
extern volatile uint32_t        CFD2MASK27SET __attribute__((section("sfrs"),address(0xBF881B38)));
extern volatile uint32_t        CFD2MASK27INV __attribute__((section("sfrs"),address(0xBF881B3C)));
#define CFD2FLTOBJ28 CFD2FLTOBJ28
extern volatile uint32_t   CFD2FLTOBJ28 __attribute__((section("sfrs"), address(0xBF881B40)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ28bits_t;
extern volatile __CFD2FLTOBJ28bits_t CFD2FLTOBJ28bits __asm__ ("CFD2FLTOBJ28") __attribute__((section("sfrs"), address(0xBF881B40)));
extern volatile uint32_t        CFD2FLTOBJ28CLR __attribute__((section("sfrs"),address(0xBF881B44)));
extern volatile uint32_t        CFD2FLTOBJ28SET __attribute__((section("sfrs"),address(0xBF881B48)));
extern volatile uint32_t        CFD2FLTOBJ28INV __attribute__((section("sfrs"),address(0xBF881B4C)));
#define CFD2MASK28 CFD2MASK28
extern volatile uint32_t   CFD2MASK28 __attribute__((section("sfrs"), address(0xBF881B50)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK28bits_t;
extern volatile __CFD2MASK28bits_t CFD2MASK28bits __asm__ ("CFD2MASK28") __attribute__((section("sfrs"), address(0xBF881B50)));
extern volatile uint32_t        CFD2MASK28CLR __attribute__((section("sfrs"),address(0xBF881B54)));
extern volatile uint32_t        CFD2MASK28SET __attribute__((section("sfrs"),address(0xBF881B58)));
extern volatile uint32_t        CFD2MASK28INV __attribute__((section("sfrs"),address(0xBF881B5C)));
#define CFD2FLTOBJ29 CFD2FLTOBJ29
extern volatile uint32_t   CFD2FLTOBJ29 __attribute__((section("sfrs"), address(0xBF881B60)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ29bits_t;
extern volatile __CFD2FLTOBJ29bits_t CFD2FLTOBJ29bits __asm__ ("CFD2FLTOBJ29") __attribute__((section("sfrs"), address(0xBF881B60)));
extern volatile uint32_t        CFD2FLTOBJ29CLR __attribute__((section("sfrs"),address(0xBF881B64)));
extern volatile uint32_t        CFD2FLTOBJ29SET __attribute__((section("sfrs"),address(0xBF881B68)));
extern volatile uint32_t        CFD2FLTOBJ29INV __attribute__((section("sfrs"),address(0xBF881B6C)));
#define CFD2MASK29 CFD2MASK29
extern volatile uint32_t   CFD2MASK29 __attribute__((section("sfrs"), address(0xBF881B70)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK29bits_t;
extern volatile __CFD2MASK29bits_t CFD2MASK29bits __asm__ ("CFD2MASK29") __attribute__((section("sfrs"), address(0xBF881B70)));
extern volatile uint32_t        CFD2MASK29CLR __attribute__((section("sfrs"),address(0xBF881B74)));
extern volatile uint32_t        CFD2MASK29SET __attribute__((section("sfrs"),address(0xBF881B78)));
extern volatile uint32_t        CFD2MASK29INV __attribute__((section("sfrs"),address(0xBF881B7C)));
#define CFD2FLTOBJ30 CFD2FLTOBJ30
extern volatile uint32_t   CFD2FLTOBJ30 __attribute__((section("sfrs"), address(0xBF881B80)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ30bits_t;
extern volatile __CFD2FLTOBJ30bits_t CFD2FLTOBJ30bits __asm__ ("CFD2FLTOBJ30") __attribute__((section("sfrs"), address(0xBF881B80)));
extern volatile uint32_t        CFD2FLTOBJ30CLR __attribute__((section("sfrs"),address(0xBF881B84)));
extern volatile uint32_t        CFD2FLTOBJ30SET __attribute__((section("sfrs"),address(0xBF881B88)));
extern volatile uint32_t        CFD2FLTOBJ30INV __attribute__((section("sfrs"),address(0xBF881B8C)));
#define CFD2MASK30 CFD2MASK30
extern volatile uint32_t   CFD2MASK30 __attribute__((section("sfrs"), address(0xBF881B90)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK30bits_t;
extern volatile __CFD2MASK30bits_t CFD2MASK30bits __asm__ ("CFD2MASK30") __attribute__((section("sfrs"), address(0xBF881B90)));
extern volatile uint32_t        CFD2MASK30CLR __attribute__((section("sfrs"),address(0xBF881B94)));
extern volatile uint32_t        CFD2MASK30SET __attribute__((section("sfrs"),address(0xBF881B98)));
extern volatile uint32_t        CFD2MASK30INV __attribute__((section("sfrs"),address(0xBF881B9C)));
#define CFD2FLTOBJ31 CFD2FLTOBJ31
extern volatile uint32_t   CFD2FLTOBJ31 __attribute__((section("sfrs"), address(0xBF881BA0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ31bits_t;
extern volatile __CFD2FLTOBJ31bits_t CFD2FLTOBJ31bits __asm__ ("CFD2FLTOBJ31") __attribute__((section("sfrs"), address(0xBF881BA0)));
extern volatile uint32_t        CFD2FLTOBJ31CLR __attribute__((section("sfrs"),address(0xBF881BA4)));
extern volatile uint32_t        CFD2FLTOBJ31SET __attribute__((section("sfrs"),address(0xBF881BA8)));
extern volatile uint32_t        CFD2FLTOBJ31INV __attribute__((section("sfrs"),address(0xBF881BAC)));
#define CFD2MASK31 CFD2MASK31
extern volatile uint32_t   CFD2MASK31 __attribute__((section("sfrs"), address(0xBF881BB0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK31bits_t;
extern volatile __CFD2MASK31bits_t CFD2MASK31bits __asm__ ("CFD2MASK31") __attribute__((section("sfrs"), address(0xBF881BB0)));
extern volatile uint32_t        CFD2MASK31CLR __attribute__((section("sfrs"),address(0xBF881BB4)));
extern volatile uint32_t        CFD2MASK31SET __attribute__((section("sfrs"),address(0xBF881BB8)));
extern volatile uint32_t        CFD2MASK31INV __attribute__((section("sfrs"),address(0xBF881BBC)));
#define CFD3CON CFD3CON
extern volatile uint32_t   CFD3CON __attribute__((section("sfrs"), address(0xBF884000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t BUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __CFD3CONbits_t;
extern volatile __CFD3CONbits_t CFD3CONbits __asm__ ("CFD3CON") __attribute__((section("sfrs"), address(0xBF884000)));
extern volatile uint32_t        CFD3CONCLR __attribute__((section("sfrs"),address(0xBF884004)));
extern volatile uint32_t        CFD3CONSET __attribute__((section("sfrs"),address(0xBF884008)));
extern volatile uint32_t        CFD3CONINV __attribute__((section("sfrs"),address(0xBF88400C)));
#define CFD3NBTCFG CFD3NBTCFG
extern volatile uint32_t   CFD3NBTCFG __attribute__((section("sfrs"), address(0xBF884010)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __CFD3NBTCFGbits_t;
