Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD3FLTOBJ10bits_t CFD3FLTOBJ10bits __asm__ ("CFD3FLTOBJ10") __attribute__((section("sfrs"), address(0xBF884900)));
extern volatile uint32_t        CFD3FLTOBJ10CLR __attribute__((section("sfrs"),address(0xBF884904)));
extern volatile uint32_t        CFD3FLTOBJ10SET __attribute__((section("sfrs"),address(0xBF884908)));
extern volatile uint32_t        CFD3FLTOBJ10INV __attribute__((section("sfrs"),address(0xBF88490C)));
#define CFD3MASK10 CFD3MASK10
extern volatile uint32_t   CFD3MASK10 __attribute__((section("sfrs"), address(0xBF884910)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK10bits_t;
extern volatile __CFD3MASK10bits_t CFD3MASK10bits __asm__ ("CFD3MASK10") __attribute__((section("sfrs"), address(0xBF884910)));
extern volatile uint32_t        CFD3MASK10CLR __attribute__((section("sfrs"),address(0xBF884914)));
extern volatile uint32_t        CFD3MASK10SET __attribute__((section("sfrs"),address(0xBF884918)));
extern volatile uint32_t        CFD3MASK10INV __attribute__((section("sfrs"),address(0xBF88491C)));
#define CFD3FLTOBJ11 CFD3FLTOBJ11
extern volatile uint32_t   CFD3FLTOBJ11 __attribute__((section("sfrs"), address(0xBF884920)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ11bits_t;
extern volatile __CFD3FLTOBJ11bits_t CFD3FLTOBJ11bits __asm__ ("CFD3FLTOBJ11") __attribute__((section("sfrs"), address(0xBF884920)));
extern volatile uint32_t        CFD3FLTOBJ11CLR __attribute__((section("sfrs"),address(0xBF884924)));
extern volatile uint32_t        CFD3FLTOBJ11SET __attribute__((section("sfrs"),address(0xBF884928)));
extern volatile uint32_t        CFD3FLTOBJ11INV __attribute__((section("sfrs"),address(0xBF88492C)));
#define CFD3MASK11 CFD3MASK11
extern volatile uint32_t   CFD3MASK11 __attribute__((section("sfrs"), address(0xBF884930)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK11bits_t;
extern volatile __CFD3MASK11bits_t CFD3MASK11bits __asm__ ("CFD3MASK11") __attribute__((section("sfrs"), address(0xBF884930)));
extern volatile uint32_t        CFD3MASK11CLR __attribute__((section("sfrs"),address(0xBF884934)));
extern volatile uint32_t        CFD3MASK11SET __attribute__((section("sfrs"),address(0xBF884938)));
extern volatile uint32_t        CFD3MASK11INV __attribute__((section("sfrs"),address(0xBF88493C)));
#define CFD3FLTOBJ12 CFD3FLTOBJ12
extern volatile uint32_t   CFD3FLTOBJ12 __attribute__((section("sfrs"), address(0xBF884940)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ12bits_t;
extern volatile __CFD3FLTOBJ12bits_t CFD3FLTOBJ12bits __asm__ ("CFD3FLTOBJ12") __attribute__((section("sfrs"), address(0xBF884940)));
extern volatile uint32_t        CFD3FLTOBJ12CLR __attribute__((section("sfrs"),address(0xBF884944)));
extern volatile uint32_t        CFD3FLTOBJ12SET __attribute__((section("sfrs"),address(0xBF884948)));
extern volatile uint32_t        CFD3FLTOBJ12INV __attribute__((section("sfrs"),address(0xBF88494C)));
#define CFD3MASK12 CFD3MASK12
extern volatile uint32_t   CFD3MASK12 __attribute__((section("sfrs"), address(0xBF884950)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK12bits_t;
extern volatile __CFD3MASK12bits_t CFD3MASK12bits __asm__ ("CFD3MASK12") __attribute__((section("sfrs"), address(0xBF884950)));
extern volatile uint32_t        CFD3MASK12CLR __attribute__((section("sfrs"),address(0xBF884954)));
extern volatile uint32_t        CFD3MASK12SET __attribute__((section("sfrs"),address(0xBF884958)));
extern volatile uint32_t        CFD3MASK12INV __attribute__((section("sfrs"),address(0xBF88495C)));
#define CFD3FLTOBJ13 CFD3FLTOBJ13
extern volatile uint32_t   CFD3FLTOBJ13 __attribute__((section("sfrs"), address(0xBF884960)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ13bits_t;
extern volatile __CFD3FLTOBJ13bits_t CFD3FLTOBJ13bits __asm__ ("CFD3FLTOBJ13") __attribute__((section("sfrs"), address(0xBF884960)));
extern volatile uint32_t        CFD3FLTOBJ13CLR __attribute__((section("sfrs"),address(0xBF884964)));
extern volatile uint32_t        CFD3FLTOBJ13SET __attribute__((section("sfrs"),address(0xBF884968)));
extern volatile uint32_t        CFD3FLTOBJ13INV __attribute__((section("sfrs"),address(0xBF88496C)));
#define CFD3MASK13 CFD3MASK13
extern volatile uint32_t   CFD3MASK13 __attribute__((section("sfrs"), address(0xBF884970)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK13bits_t;
extern volatile __CFD3MASK13bits_t CFD3MASK13bits __asm__ ("CFD3MASK13") __attribute__((section("sfrs"), address(0xBF884970)));
extern volatile uint32_t        CFD3MASK13CLR __attribute__((section("sfrs"),address(0xBF884974)));
extern volatile uint32_t        CFD3MASK13SET __attribute__((section("sfrs"),address(0xBF884978)));
extern volatile uint32_t        CFD3MASK13INV __attribute__((section("sfrs"),address(0xBF88497C)));
#define CFD3FLTOBJ14 CFD3FLTOBJ14
extern volatile uint32_t   CFD3FLTOBJ14 __attribute__((section("sfrs"), address(0xBF884980)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ14bits_t;
extern volatile __CFD3FLTOBJ14bits_t CFD3FLTOBJ14bits __asm__ ("CFD3FLTOBJ14") __attribute__((section("sfrs"), address(0xBF884980)));
extern volatile uint32_t        CFD3FLTOBJ14CLR __attribute__((section("sfrs"),address(0xBF884984)));
extern volatile uint32_t        CFD3FLTOBJ14SET __attribute__((section("sfrs"),address(0xBF884988)));
extern volatile uint32_t        CFD3FLTOBJ14INV __attribute__((section("sfrs"),address(0xBF88498C)));
#define CFD3MASK14 CFD3MASK14
extern volatile uint32_t   CFD3MASK14 __attribute__((section("sfrs"), address(0xBF884990)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK14bits_t;
extern volatile __CFD3MASK14bits_t CFD3MASK14bits __asm__ ("CFD3MASK14") __attribute__((section("sfrs"), address(0xBF884990)));
extern volatile uint32_t        CFD3MASK14CLR __attribute__((section("sfrs"),address(0xBF884994)));
extern volatile uint32_t        CFD3MASK14SET __attribute__((section("sfrs"),address(0xBF884998)));
extern volatile uint32_t        CFD3MASK14INV __attribute__((section("sfrs"),address(0xBF88499C)));
#define CFD3FLTOBJ15 CFD3FLTOBJ15
extern volatile uint32_t   CFD3FLTOBJ15 __attribute__((section("sfrs"), address(0xBF8849A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ15bits_t;
extern volatile __CFD3FLTOBJ15bits_t CFD3FLTOBJ15bits __asm__ ("CFD3FLTOBJ15") __attribute__((section("sfrs"), address(0xBF8849A0)));
extern volatile uint32_t        CFD3FLTOBJ15CLR __attribute__((section("sfrs"),address(0xBF8849A4)));
extern volatile uint32_t        CFD3FLTOBJ15SET __attribute__((section("sfrs"),address(0xBF8849A8)));
extern volatile uint32_t        CFD3FLTOBJ15INV __attribute__((section("sfrs"),address(0xBF8849AC)));
#define CFD3MASK15 CFD3MASK15
extern volatile uint32_t   CFD3MASK15 __attribute__((section("sfrs"), address(0xBF8849B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD3MASK15bits_t;
extern volatile __CFD3MASK15bits_t CFD3MASK15bits __asm__ ("CFD3MASK15") __attribute__((section("sfrs"), address(0xBF8849B0)));
extern volatile uint32_t        CFD3MASK15CLR __attribute__((section("sfrs"),address(0xBF8849B4)));
extern volatile uint32_t        CFD3MASK15SET __attribute__((section("sfrs"),address(0xBF8849B8)));
extern volatile uint32_t        CFD3MASK15INV __attribute__((section("sfrs"),address(0xBF8849BC)));
#define CFD3FLTOBJ16 CFD3FLTOBJ16
extern volatile uint32_t   CFD3FLTOBJ16 __attribute__((section("sfrs"), address(0xBF8849C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD3FLTOBJ16bits_t;
