Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD4TRECbits_t CFD4TRECbits __asm__ ("CFD4TREC") __attribute__((section("sfrs"), address(0xBF8850D0)));
extern volatile uint32_t        CFD4TRECCLR __attribute__((section("sfrs"),address(0xBF8850D4)));
extern volatile uint32_t        CFD4TRECSET __attribute__((section("sfrs"),address(0xBF8850D8)));
extern volatile uint32_t        CFD4TRECINV __attribute__((section("sfrs"),address(0xBF8850DC)));
#define CFD4BDIAG0 CFD4BDIAG0
extern volatile uint32_t   CFD4BDIAG0 __attribute__((section("sfrs"), address(0xBF8850E0)));
typedef struct {
  uint32_t NRERRCNT:8;
  uint32_t NTERRCNT:8;
  uint32_t DRERRCNT:8;
  uint32_t DTERRCNT:8;
} __CFD4BDIAG0bits_t;
extern volatile __CFD4BDIAG0bits_t CFD4BDIAG0bits __asm__ ("CFD4BDIAG0") __attribute__((section("sfrs"), address(0xBF8850E0)));
extern volatile uint32_t        CFD4BDIAG0CLR __attribute__((section("sfrs"),address(0xBF8850E4)));
extern volatile uint32_t        CFD4BDIAG0SET __attribute__((section("sfrs"),address(0xBF8850E8)));
extern volatile uint32_t        CFD4BDIAG0INV __attribute__((section("sfrs"),address(0xBF8850EC)));
#define CFD4BDIAG1 CFD4BDIAG1
extern volatile uint32_t   CFD4BDIAG1 __attribute__((section("sfrs"), address(0xBF8850F0)));
typedef struct {
  uint32_t EFMSGCNT:16;
  uint32_t NBIT0ERR:1;
  uint32_t NBIT1ERR:1;
  uint32_t NACKERR:1;
  uint32_t NFORMERR:1;
  uint32_t NSTUFERR:1;
  uint32_t NCRCERR:1;
  uint32_t :2;
  uint32_t DBIT0ERR:1;
  uint32_t DBIT1ERR:1;
  uint32_t :1;
  uint32_t DFORMERR:1;
  uint32_t DSTUFERR:1;
  uint32_t DCRCERR:1;
  uint32_t ESI:1;
  uint32_t DLCMM:1;
} __CFD4BDIAG1bits_t;
extern volatile __CFD4BDIAG1bits_t CFD4BDIAG1bits __asm__ ("CFD4BDIAG1") __attribute__((section("sfrs"), address(0xBF8850F0)));
extern volatile uint32_t        CFD4BDIAG1CLR __attribute__((section("sfrs"),address(0xBF8850F4)));
extern volatile uint32_t        CFD4BDIAG1SET __attribute__((section("sfrs"),address(0xBF8850F8)));
extern volatile uint32_t        CFD4BDIAG1INV __attribute__((section("sfrs"),address(0xBF8850FC)));
#define CFD4TEFCON CFD4TEFCON
extern volatile uint32_t   CFD4TEFCON __attribute__((section("sfrs"), address(0xBF885100)));
typedef struct {
  uint32_t TEFNEIE:1;
  uint32_t TEFHIE:1;
  uint32_t TEFFIE:1;
  uint32_t TEFOVIE:1;
  uint32_t :1;
  uint32_t TEFTSEN:1;
  uint32_t :2;
  uint32_t UINC:1;
  uint32_t :1;
  uint32_t FRESET:1;
  uint32_t :13;
  uint32_t FSIZE:5;
} __CFD4TEFCONbits_t;
extern volatile __CFD4TEFCONbits_t CFD4TEFCONbits __asm__ ("CFD4TEFCON") __attribute__((section("sfrs"), address(0xBF885100)));
extern volatile uint32_t        CFD4TEFCONCLR __attribute__((section("sfrs"),address(0xBF885104)));
extern volatile uint32_t        CFD4TEFCONSET __attribute__((section("sfrs"),address(0xBF885108)));
extern volatile uint32_t        CFD4TEFCONINV __attribute__((section("sfrs"),address(0xBF88510C)));
#define CFD4TEFSTA CFD4TEFSTA
extern volatile uint32_t   CFD4TEFSTA __attribute__((section("sfrs"), address(0xBF885110)));
typedef struct {
  uint32_t TEFNEIF:1;
  uint32_t TEFHIF:1;
  uint32_t TEFFIF:1;
  uint32_t TEFOVIF:1;
} __CFD4TEFSTAbits_t;
extern volatile __CFD4TEFSTAbits_t CFD4TEFSTAbits __asm__ ("CFD4TEFSTA") __attribute__((section("sfrs"), address(0xBF885110)));
extern volatile uint32_t        CFD4TEFSTACLR __attribute__((section("sfrs"),address(0xBF885114)));
extern volatile uint32_t        CFD4TEFSTASET __attribute__((section("sfrs"),address(0xBF885118)));
extern volatile uint32_t        CFD4TEFSTAINV __attribute__((section("sfrs"),address(0xBF88511C)));
#define CFD4TEFUA CFD4TEFUA
extern volatile uint32_t   CFD4TEFUA __attribute__((section("sfrs"), address(0xBF885120)));
typedef struct {
  uint32_t TEFUA:32;
} __CFD4TEFUAbits_t;
extern volatile __CFD4TEFUAbits_t CFD4TEFUAbits __asm__ ("CFD4TEFUA") __attribute__((section("sfrs"), address(0xBF885120)));
extern volatile uint32_t        CFD4TEFUACLR __attribute__((section("sfrs"),address(0xBF885124)));
extern volatile uint32_t        CFD4TEFUASET __attribute__((section("sfrs"),address(0xBF885128)));
extern volatile uint32_t        CFD4TEFUAINV __attribute__((section("sfrs"),address(0xBF88512C)));
#define CFD4FIFOBA CFD4FIFOBA
extern volatile uint32_t   CFD4FIFOBA __attribute__((section("sfrs"), address(0xBF885130)));
typedef struct {
  uint32_t FIFOBA:32;
} __CFD4FIFOBAbits_t;
extern volatile __CFD4FIFOBAbits_t CFD4FIFOBAbits __asm__ ("CFD4FIFOBA") __attribute__((section("sfrs"), address(0xBF885130)));
extern volatile uint32_t        CFD4FIFOBACLR __attribute__((section("sfrs"),address(0xBF885134)));
extern volatile uint32_t        CFD4FIFOBASET __attribute__((section("sfrs"),address(0xBF885138)));
extern volatile uint32_t        CFD4FIFOBAINV __attribute__((section("sfrs"),address(0xBF88513C)));
#define CFD4TXQCON CFD4TXQCON
extern volatile uint32_t   CFD4TXQCON __attribute__((section("sfrs"), address(0xBF885140)));
typedef struct {
  uint32_t TXQNIE:1;
  uint32_t :1;
  uint32_t TXQEIE:1;
  uint32_t :1;
  uint32_t TXATIE:1;
  uint32_t :2;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4TXQCONbits_t;
extern volatile __CFD4TXQCONbits_t CFD4TXQCONbits __asm__ ("CFD4TXQCON") __attribute__((section("sfrs"), address(0xBF885140)));
extern volatile uint32_t        CFD4TXQCONCLR __attribute__((section("sfrs"),address(0xBF885144)));
extern volatile uint32_t        CFD4TXQCONSET __attribute__((section("sfrs"),address(0xBF885148)));
extern volatile uint32_t        CFD4TXQCONINV __attribute__((section("sfrs"),address(0xBF88514C)));
#define CFD4TXQSTA CFD4TXQSTA
extern volatile uint32_t   CFD4TXQSTA __attribute__((section("sfrs"), address(0xBF885150)));
typedef struct {
  uint32_t TXQNIF:1;
  uint32_t :1;
  uint32_t TXQEIF:1;
  uint32_t :1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t TXQCI:5;
} __CFD4TXQSTAbits_t;
extern volatile __CFD4TXQSTAbits_t CFD4TXQSTAbits __asm__ ("CFD4TXQSTA") __attribute__((section("sfrs"), address(0xBF885150)));
extern volatile uint32_t        CFD4TXQSTACLR __attribute__((section("sfrs"),address(0xBF885154)));
extern volatile uint32_t        CFD4TXQSTASET __attribute__((section("sfrs"),address(0xBF885158)));
extern volatile uint32_t        CFD4TXQSTAINV __attribute__((section("sfrs"),address(0xBF88515C)));
#define CFD4TXQUA CFD4TXQUA
extern volatile uint32_t   CFD4TXQUA __attribute__((section("sfrs"), address(0xBF885160)));
typedef struct {
  uint32_t TXQUA:32;
} __CFD4TXQUAbits_t;
extern volatile __CFD4TXQUAbits_t CFD4TXQUAbits __asm__ ("CFD4TXQUA") __attribute__((section("sfrs"), address(0xBF885160)));
extern volatile uint32_t        CFD4TXQUACLR __attribute__((section("sfrs"),address(0xBF885164)));
extern volatile uint32_t        CFD4TXQUASET __attribute__((section("sfrs"),address(0xBF885168)));
extern volatile uint32_t        CFD4TXQUAINV __attribute__((section("sfrs"),address(0xBF88516C)));
#define CFD4FIFOCON1 CFD4FIFOCON1
extern volatile uint32_t   CFD4FIFOCON1 __attribute__((section("sfrs"), address(0xBF885170)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON1bits_t;
