Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD4FIFOUA19bits_t CFD4FIFOUA19bits __asm__ ("CFD4FIFOUA19") __attribute__((section("sfrs"), address(0xBF8854F0)));
extern volatile uint32_t        CFD4FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF8854F4)));
extern volatile uint32_t        CFD4FIFOUA19SET __attribute__((section("sfrs"),address(0xBF8854F8)));
extern volatile uint32_t        CFD4FIFOUA19INV __attribute__((section("sfrs"),address(0xBF8854FC)));
#define CFD4FIFOCON20 CFD4FIFOCON20
extern volatile uint32_t   CFD4FIFOCON20 __attribute__((section("sfrs"), address(0xBF885500)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON20bits_t;
extern volatile __CFD4FIFOCON20bits_t CFD4FIFOCON20bits __asm__ ("CFD4FIFOCON20") __attribute__((section("sfrs"), address(0xBF885500)));
extern volatile uint32_t        CFD4FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF885504)));
extern volatile uint32_t        CFD4FIFOCON20SET __attribute__((section("sfrs"),address(0xBF885508)));
extern volatile uint32_t        CFD4FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88550C)));
#define CFD4FIFOSTA20 CFD4FIFOSTA20
extern volatile uint32_t   CFD4FIFOSTA20 __attribute__((section("sfrs"), address(0xBF885510)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA20bits_t;
extern volatile __CFD4FIFOSTA20bits_t CFD4FIFOSTA20bits __asm__ ("CFD4FIFOSTA20") __attribute__((section("sfrs"), address(0xBF885510)));
extern volatile uint32_t        CFD4FIFOSTA20CLR __attribute__((section("sfrs"),address(0xBF885514)));
extern volatile uint32_t        CFD4FIFOSTA20SET __attribute__((section("sfrs"),address(0xBF885518)));
extern volatile uint32_t        CFD4FIFOSTA20INV __attribute__((section("sfrs"),address(0xBF88551C)));
#define CFD4FIFOUA20 CFD4FIFOUA20
extern volatile uint32_t   CFD4FIFOUA20 __attribute__((section("sfrs"), address(0xBF885520)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA20bits_t;
extern volatile __CFD4FIFOUA20bits_t CFD4FIFOUA20bits __asm__ ("CFD4FIFOUA20") __attribute__((section("sfrs"), address(0xBF885520)));
extern volatile uint32_t        CFD4FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF885524)));
extern volatile uint32_t        CFD4FIFOUA20SET __attribute__((section("sfrs"),address(0xBF885528)));
extern volatile uint32_t        CFD4FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88552C)));
#define CFD4FIFOCON21 CFD4FIFOCON21
extern volatile uint32_t   CFD4FIFOCON21 __attribute__((section("sfrs"), address(0xBF885530)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON21bits_t;
extern volatile __CFD4FIFOCON21bits_t CFD4FIFOCON21bits __asm__ ("CFD4FIFOCON21") __attribute__((section("sfrs"), address(0xBF885530)));
extern volatile uint32_t        CFD4FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF885534)));
extern volatile uint32_t        CFD4FIFOCON21SET __attribute__((section("sfrs"),address(0xBF885538)));
extern volatile uint32_t        CFD4FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88553C)));
#define CFD4FIFOSTA21 CFD4FIFOSTA21
extern volatile uint32_t   CFD4FIFOSTA21 __attribute__((section("sfrs"), address(0xBF885540)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA21bits_t;
extern volatile __CFD4FIFOSTA21bits_t CFD4FIFOSTA21bits __asm__ ("CFD4FIFOSTA21") __attribute__((section("sfrs"), address(0xBF885540)));
extern volatile uint32_t        CFD4FIFOSTA21CLR __attribute__((section("sfrs"),address(0xBF885544)));
extern volatile uint32_t        CFD4FIFOSTA21SET __attribute__((section("sfrs"),address(0xBF885548)));
extern volatile uint32_t        CFD4FIFOSTA21INV __attribute__((section("sfrs"),address(0xBF88554C)));
#define CFD4FIFOUA21 CFD4FIFOUA21
extern volatile uint32_t   CFD4FIFOUA21 __attribute__((section("sfrs"), address(0xBF885550)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA21bits_t;
extern volatile __CFD4FIFOUA21bits_t CFD4FIFOUA21bits __asm__ ("CFD4FIFOUA21") __attribute__((section("sfrs"), address(0xBF885550)));
extern volatile uint32_t        CFD4FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF885554)));
extern volatile uint32_t        CFD4FIFOUA21SET __attribute__((section("sfrs"),address(0xBF885558)));
extern volatile uint32_t        CFD4FIFOUA21INV __attribute__((section("sfrs"),address(0xBF88555C)));
#define CFD4FIFOCON22 CFD4FIFOCON22
extern volatile uint32_t   CFD4FIFOCON22 __attribute__((section("sfrs"), address(0xBF885560)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON22bits_t;
extern volatile __CFD4FIFOCON22bits_t CFD4FIFOCON22bits __asm__ ("CFD4FIFOCON22") __attribute__((section("sfrs"), address(0xBF885560)));
extern volatile uint32_t        CFD4FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF885564)));
extern volatile uint32_t        CFD4FIFOCON22SET __attribute__((section("sfrs"),address(0xBF885568)));
extern volatile uint32_t        CFD4FIFOCON22INV __attribute__((section("sfrs"),address(0xBF88556C)));
#define CFD4FIFOSTA22 CFD4FIFOSTA22
extern volatile uint32_t   CFD4FIFOSTA22 __attribute__((section("sfrs"), address(0xBF885570)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA22bits_t;
