Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __CFD4FLTOBJ8bits_t CFD4FLTOBJ8bits __asm__ ("CFD4FLTOBJ8") __attribute__((section("sfrs"), address(0xBF8858C0)));
extern volatile uint32_t        CFD4FLTOBJ8CLR __attribute__((section("sfrs"),address(0xBF8858C4)));
extern volatile uint32_t        CFD4FLTOBJ8SET __attribute__((section("sfrs"),address(0xBF8858C8)));
extern volatile uint32_t        CFD4FLTOBJ8INV __attribute__((section("sfrs"),address(0xBF8858CC)));
#define CFD4MASK8 CFD4MASK8
extern volatile uint32_t   CFD4MASK8 __attribute__((section("sfrs"), address(0xBF8858D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK8bits_t;
extern volatile __CFD4MASK8bits_t CFD4MASK8bits __asm__ ("CFD4MASK8") __attribute__((section("sfrs"), address(0xBF8858D0)));
extern volatile uint32_t        CFD4MASK8CLR __attribute__((section("sfrs"),address(0xBF8858D4)));
extern volatile uint32_t        CFD4MASK8SET __attribute__((section("sfrs"),address(0xBF8858D8)));
extern volatile uint32_t        CFD4MASK8INV __attribute__((section("sfrs"),address(0xBF8858DC)));
#define CFD4FLTOBJ9 CFD4FLTOBJ9
extern volatile uint32_t   CFD4FLTOBJ9 __attribute__((section("sfrs"), address(0xBF8858E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ9bits_t;
extern volatile __CFD4FLTOBJ9bits_t CFD4FLTOBJ9bits __asm__ ("CFD4FLTOBJ9") __attribute__((section("sfrs"), address(0xBF8858E0)));
extern volatile uint32_t        CFD4FLTOBJ9CLR __attribute__((section("sfrs"),address(0xBF8858E4)));
extern volatile uint32_t        CFD4FLTOBJ9SET __attribute__((section("sfrs"),address(0xBF8858E8)));
extern volatile uint32_t        CFD4FLTOBJ9INV __attribute__((section("sfrs"),address(0xBF8858EC)));
#define CFD4MASK9 CFD4MASK9
extern volatile uint32_t   CFD4MASK9 __attribute__((section("sfrs"), address(0xBF8858F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK9bits_t;
extern volatile __CFD4MASK9bits_t CFD4MASK9bits __asm__ ("CFD4MASK9") __attribute__((section("sfrs"), address(0xBF8858F0)));
extern volatile uint32_t        CFD4MASK9CLR __attribute__((section("sfrs"),address(0xBF8858F4)));
extern volatile uint32_t        CFD4MASK9SET __attribute__((section("sfrs"),address(0xBF8858F8)));
extern volatile uint32_t        CFD4MASK9INV __attribute__((section("sfrs"),address(0xBF8858FC)));
#define CFD4FLTOBJ10 CFD4FLTOBJ10
extern volatile uint32_t   CFD4FLTOBJ10 __attribute__((section("sfrs"), address(0xBF885900)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ10bits_t;
extern volatile __CFD4FLTOBJ10bits_t CFD4FLTOBJ10bits __asm__ ("CFD4FLTOBJ10") __attribute__((section("sfrs"), address(0xBF885900)));
extern volatile uint32_t        CFD4FLTOBJ10CLR __attribute__((section("sfrs"),address(0xBF885904)));
extern volatile uint32_t        CFD4FLTOBJ10SET __attribute__((section("sfrs"),address(0xBF885908)));
extern volatile uint32_t        CFD4FLTOBJ10INV __attribute__((section("sfrs"),address(0xBF88590C)));
#define CFD4MASK10 CFD4MASK10
extern volatile uint32_t   CFD4MASK10 __attribute__((section("sfrs"), address(0xBF885910)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK10bits_t;
extern volatile __CFD4MASK10bits_t CFD4MASK10bits __asm__ ("CFD4MASK10") __attribute__((section("sfrs"), address(0xBF885910)));
extern volatile uint32_t        CFD4MASK10CLR __attribute__((section("sfrs"),address(0xBF885914)));
extern volatile uint32_t        CFD4MASK10SET __attribute__((section("sfrs"),address(0xBF885918)));
extern volatile uint32_t        CFD4MASK10INV __attribute__((section("sfrs"),address(0xBF88591C)));
#define CFD4FLTOBJ11 CFD4FLTOBJ11
extern volatile uint32_t   CFD4FLTOBJ11 __attribute__((section("sfrs"), address(0xBF885920)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ11bits_t;
extern volatile __CFD4FLTOBJ11bits_t CFD4FLTOBJ11bits __asm__ ("CFD4FLTOBJ11") __attribute__((section("sfrs"), address(0xBF885920)));
extern volatile uint32_t        CFD4FLTOBJ11CLR __attribute__((section("sfrs"),address(0xBF885924)));
extern volatile uint32_t        CFD4FLTOBJ11SET __attribute__((section("sfrs"),address(0xBF885928)));
extern volatile uint32_t        CFD4FLTOBJ11INV __attribute__((section("sfrs"),address(0xBF88592C)));
#define CFD4MASK11 CFD4MASK11
extern volatile uint32_t   CFD4MASK11 __attribute__((section("sfrs"), address(0xBF885930)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK11bits_t;
extern volatile __CFD4MASK11bits_t CFD4MASK11bits __asm__ ("CFD4MASK11") __attribute__((section("sfrs"), address(0xBF885930)));
extern volatile uint32_t        CFD4MASK11CLR __attribute__((section("sfrs"),address(0xBF885934)));
extern volatile uint32_t        CFD4MASK11SET __attribute__((section("sfrs"),address(0xBF885938)));
extern volatile uint32_t        CFD4MASK11INV __attribute__((section("sfrs"),address(0xBF88593C)));
#define CFD4FLTOBJ12 CFD4FLTOBJ12
extern volatile uint32_t   CFD4FLTOBJ12 __attribute__((section("sfrs"), address(0xBF885940)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ12bits_t;
extern volatile __CFD4FLTOBJ12bits_t CFD4FLTOBJ12bits __asm__ ("CFD4FLTOBJ12") __attribute__((section("sfrs"), address(0xBF885940)));
extern volatile uint32_t        CFD4FLTOBJ12CLR __attribute__((section("sfrs"),address(0xBF885944)));
extern volatile uint32_t        CFD4FLTOBJ12SET __attribute__((section("sfrs"),address(0xBF885948)));
extern volatile uint32_t        CFD4FLTOBJ12INV __attribute__((section("sfrs"),address(0xBF88594C)));
#define CFD4MASK12 CFD4MASK12
extern volatile uint32_t   CFD4MASK12 __attribute__((section("sfrs"), address(0xBF885950)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK12bits_t;
