Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __SBT2WR0bits_t SBT2WR0bits __asm__ ("SBT2WR0") __attribute__((section("sfrs"), address(0xBF8F8858)));
#define SBT2REG1 SBT2REG1
extern volatile uint32_t   SBT2REG1 __attribute__((section("sfrs"), address(0xBF8F8860)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT2REG1bits_t;
extern volatile __SBT2REG1bits_t SBT2REG1bits __asm__ ("SBT2REG1") __attribute__((section("sfrs"), address(0xBF8F8860)));
#define SBT2RD1 SBT2RD1
extern volatile uint32_t   SBT2RD1 __attribute__((section("sfrs"), address(0xBF8F8870)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT2RD1bits_t;
extern volatile __SBT2RD1bits_t SBT2RD1bits __asm__ ("SBT2RD1") __attribute__((section("sfrs"), address(0xBF8F8870)));
#define SBT2WR1 SBT2WR1
extern volatile uint32_t   SBT2WR1 __attribute__((section("sfrs"), address(0xBF8F8878)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT2WR1bits_t;
extern volatile __SBT2WR1bits_t SBT2WR1bits __asm__ ("SBT2WR1") __attribute__((section("sfrs"), address(0xBF8F8878)));
#define SBT2REG2 SBT2REG2
extern volatile uint32_t   SBT2REG2 __attribute__((section("sfrs"), address(0xBF8F8880)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT2REG2bits_t;
extern volatile __SBT2REG2bits_t SBT2REG2bits __asm__ ("SBT2REG2") __attribute__((section("sfrs"), address(0xBF8F8880)));
#define SBT2RD2 SBT2RD2
extern volatile uint32_t   SBT2RD2 __attribute__((section("sfrs"), address(0xBF8F8890)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT2RD2bits_t;
extern volatile __SBT2RD2bits_t SBT2RD2bits __asm__ ("SBT2RD2") __attribute__((section("sfrs"), address(0xBF8F8890)));
#define SBT2WR2 SBT2WR2
extern volatile uint32_t   SBT2WR2 __attribute__((section("sfrs"), address(0xBF8F8898)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT2WR2bits_t;
extern volatile __SBT2WR2bits_t SBT2WR2bits __asm__ ("SBT2WR2") __attribute__((section("sfrs"), address(0xBF8F8898)));
#define SBT3ELOG1 SBT3ELOG1
extern volatile uint32_t   SBT3ELOG1 __attribute__((section("sfrs"), address(0xBF8F8C20)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT3ELOG1bits_t;
extern volatile __SBT3ELOG1bits_t SBT3ELOG1bits __asm__ ("SBT3ELOG1") __attribute__((section("sfrs"), address(0xBF8F8C20)));
#define SBT3ELOG2 SBT3ELOG2
extern volatile uint32_t   SBT3ELOG2 __attribute__((section("sfrs"), address(0xBF8F8C24)));
typedef struct {
  uint32_t GROUP:2;
} __SBT3ELOG2bits_t;
extern volatile __SBT3ELOG2bits_t SBT3ELOG2bits __asm__ ("SBT3ELOG2") __attribute__((section("sfrs"), address(0xBF8F8C24)));
#define SBT3ECON SBT3ECON
extern volatile uint32_t   SBT3ECON __attribute__((section("sfrs"), address(0xBF8F8C28)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT3ECONbits_t;
extern volatile __SBT3ECONbits_t SBT3ECONbits __asm__ ("SBT3ECON") __attribute__((section("sfrs"), address(0xBF8F8C28)));
#define SBT3ECLRS SBT3ECLRS
extern volatile uint32_t   SBT3ECLRS __attribute__((section("sfrs"), address(0xBF8F8C30)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT3ECLRSbits_t;
extern volatile __SBT3ECLRSbits_t SBT3ECLRSbits __asm__ ("SBT3ECLRS") __attribute__((section("sfrs"), address(0xBF8F8C30)));
#define SBT3ECLRM SBT3ECLRM
extern volatile uint32_t   SBT3ECLRM __attribute__((section("sfrs"), address(0xBF8F8C38)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT3ECLRMbits_t;
extern volatile __SBT3ECLRMbits_t SBT3ECLRMbits __asm__ ("SBT3ECLRM") __attribute__((section("sfrs"), address(0xBF8F8C38)));
#define SBT3REG0 SBT3REG0
extern volatile uint32_t   SBT3REG0 __attribute__((section("sfrs"), address(0xBF8F8C40)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT3REG0bits_t;
extern volatile __SBT3REG0bits_t SBT3REG0bits __asm__ ("SBT3REG0") __attribute__((section("sfrs"), address(0xBF8F8C40)));
#define SBT3RD0 SBT3RD0
extern volatile uint32_t   SBT3RD0 __attribute__((section("sfrs"), address(0xBF8F8C50)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD0bits_t;
extern volatile __SBT3RD0bits_t SBT3RD0bits __asm__ ("SBT3RD0") __attribute__((section("sfrs"), address(0xBF8F8C50)));
#define SBT3WR0 SBT3WR0
extern volatile uint32_t   SBT3WR0 __attribute__((section("sfrs"), address(0xBF8F8C58)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR0bits_t;
extern volatile __SBT3WR0bits_t SBT3WR0bits __asm__ ("SBT3WR0") __attribute__((section("sfrs"), address(0xBF8F8C58)));
#define SBT3REG1 SBT3REG1
extern volatile uint32_t   SBT3REG1 __attribute__((section("sfrs"), address(0xBF8F8C60)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT3REG1bits_t;
extern volatile __SBT3REG1bits_t SBT3REG1bits __asm__ ("SBT3REG1") __attribute__((section("sfrs"), address(0xBF8F8C60)));
#define SBT3RD1 SBT3RD1
extern volatile uint32_t   SBT3RD1 __attribute__((section("sfrs"), address(0xBF8F8C70)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD1bits_t;
extern volatile __SBT3RD1bits_t SBT3RD1bits __asm__ ("SBT3RD1") __attribute__((section("sfrs"), address(0xBF8F8C70)));
#define SBT3WR1 SBT3WR1
extern volatile uint32_t   SBT3WR1 __attribute__((section("sfrs"), address(0xBF8F8C78)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR1bits_t;
extern volatile __SBT3WR1bits_t SBT3WR1bits __asm__ ("SBT3WR1") __attribute__((section("sfrs"), address(0xBF8F8C78)));
#define SBT3REG2 SBT3REG2
extern volatile uint32_t   SBT3REG2 __attribute__((section("sfrs"), address(0xBF8F8C80)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT3REG2bits_t;
extern volatile __SBT3REG2bits_t SBT3REG2bits __asm__ ("SBT3REG2") __attribute__((section("sfrs"), address(0xBF8F8C80)));
#define SBT3RD2 SBT3RD2
extern volatile uint32_t   SBT3RD2 __attribute__((section("sfrs"), address(0xBF8F8C90)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD2bits_t;
extern volatile __SBT3RD2bits_t SBT3RD2bits __asm__ ("SBT3RD2") __attribute__((section("sfrs"), address(0xBF8F8C90)));
#define SBT3WR2 SBT3WR2
extern volatile uint32_t   SBT3WR2 __attribute__((section("sfrs"), address(0xBF8F8C98)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR2bits_t;
extern volatile __SBT3WR2bits_t SBT3WR2bits __asm__ ("SBT3WR2") __attribute__((section("sfrs"), address(0xBF8F8C98)));
#define DEVCFG4 DEVCFG4
extern volatile uint32_t   DEVCFG4 __attribute__((section("sfrs"), address(0xBFC03FBC)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t A1DIFFPR:2;
    uint32_t A2DIFFPR:2;
    uint32_t A3DIFFPR:2;
    uint32_t A5DIFFPR:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG4bits_t;
