Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
extern volatile __ABF2DEVCFG2bits_t ABF2DEVCFG2bits __asm__ ("ABF2DEVCFG2") __attribute__((section("sfrs"), address(0xBFC63F44)));
#define ABF2DEVCFG1 ABF2DEVCFG1
extern volatile uint32_t   ABF2DEVCFG1 __attribute__((section("sfrs"), address(0xBFC63F48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG1bits_t;
extern volatile __ABF2DEVCFG1bits_t ABF2DEVCFG1bits __asm__ ("ABF2DEVCFG1") __attribute__((section("sfrs"), address(0xBFC63F48)));
#define ABF2DEVCFG0 ABF2DEVCFG0
extern volatile uint32_t   ABF2DEVCFG0 __attribute__((section("sfrs"), address(0xBFC63F4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG0bits_t;
extern volatile __ABF2DEVCFG0bits_t ABF2DEVCFG0bits __asm__ ("ABF2DEVCFG0") __attribute__((section("sfrs"), address(0xBFC63F4C)));
#define ABF2DEVCP ABF2DEVCP
extern volatile uint32_t   ABF2DEVCP __attribute__((section("sfrs"), address(0xBFC63F5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCPbits_t;
extern volatile __ABF2DEVCPbits_t ABF2DEVCPbits __asm__ ("ABF2DEVCP") __attribute__((section("sfrs"), address(0xBFC63F5C)));
#define ABF2DEVSIGN ABF2DEVSIGN
extern volatile uint32_t   ABF2DEVSIGN __attribute__((section("sfrs"), address(0xBFC63F6C)));
#define ABF2SEQ ABF2SEQ
extern volatile uint32_t   ABF2SEQ __attribute__((section("sfrs"), address(0xBFC63F70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2SEQbits_t;
extern volatile __ABF2SEQbits_t ABF2SEQbits __asm__ ("ABF2SEQ") __attribute__((section("sfrs"), address(0xBFC63F70)));
#define BF2DEVCFG4 BF2DEVCFG4
extern volatile uint32_t   BF2DEVCFG4 __attribute__((section("sfrs"), address(0xBFC63FBC)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t A1DIFFPR:2;
    uint32_t A2DIFFPR:2;
    uint32_t A3DIFFPR:2;
    uint32_t A5DIFFPR:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG4bits_t;
extern volatile __BF2DEVCFG4bits_t BF2DEVCFG4bits __asm__ ("BF2DEVCFG4") __attribute__((section("sfrs"), address(0xBFC63FBC)));
#define BF2DEVCFG3 BF2DEVCFG3
extern volatile uint32_t   BF2DEVCFG3 __attribute__((section("sfrs"), address(0xBFC63FC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t FUSBIDIO2:1;
    uint32_t FVBUSIO2:1;
    uint32_t :3;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG3bits_t;
extern volatile __BF2DEVCFG3bits_t BF2DEVCFG3bits __asm__ ("BF2DEVCFG3") __attribute__((section("sfrs"), address(0xBFC63FC0)));
#define BF2DEVCFG2 BF2DEVCFG2
extern volatile uint32_t   BF2DEVCFG2 __attribute__((section("sfrs"), address(0xBFC63FC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG2bits_t;
extern volatile __BF2DEVCFG2bits_t BF2DEVCFG2bits __asm__ ("BF2DEVCFG2") __attribute__((section("sfrs"), address(0xBFC63FC4)));
#define BF2DEVCFG1 BF2DEVCFG1
extern volatile uint32_t   BF2DEVCFG1 __attribute__((section("sfrs"), address(0xBFC63FC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG1bits_t;
extern volatile __BF2DEVCFG1bits_t BF2DEVCFG1bits __asm__ ("BF2DEVCFG1") __attribute__((section("sfrs"), address(0xBFC63FC8)));
#define BF2DEVCFG0 BF2DEVCFG0
extern volatile uint32_t   BF2DEVCFG0 __attribute__((section("sfrs"), address(0xBFC63FCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG0bits_t;
extern volatile __BF2DEVCFG0bits_t BF2DEVCFG0bits __asm__ ("BF2DEVCFG0") __attribute__((section("sfrs"), address(0xBFC63FCC)));
#define BF2DEVCP BF2DEVCP
extern volatile uint32_t   BF2DEVCP __attribute__((section("sfrs"), address(0xBFC63FDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCPbits_t;
extern volatile __BF2DEVCPbits_t BF2DEVCPbits __asm__ ("BF2DEVCP") __attribute__((section("sfrs"), address(0xBFC63FDC)));
#define BF2DEVSIGN BF2DEVSIGN
extern volatile uint32_t   BF2DEVSIGN __attribute__((section("sfrs"), address(0xBFC63FEC)));
#define BF2SEQ BF2SEQ
extern volatile uint32_t   BF2SEQ __attribute__((section("sfrs"), address(0xBFC63FF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __BF2SEQbits_t;
