Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _RPB4R_RPB4R_POSITION                    0x00000000
#define _RPB4R_RPB4R_MASK                        0x0000001F
#define _RPB4R_RPB4R_LENGTH                      0x00000005

#define _RPB5R_RPB5R_POSITION                    0x00000000
#define _RPB5R_RPB5R_MASK                        0x0000001F
#define _RPB5R_RPB5R_LENGTH                      0x00000005

#define _RPB6R_RPB6R_POSITION                    0x00000000
#define _RPB6R_RPB6R_MASK                        0x0000001F
#define _RPB6R_RPB6R_LENGTH                      0x00000005

#define _RPB7R_RPB7R_POSITION                    0x00000000
#define _RPB7R_RPB7R_MASK                        0x0000001F
#define _RPB7R_RPB7R_LENGTH                      0x00000005

#define _RPB9R_RPB9R_POSITION                    0x00000000
#define _RPB9R_RPB9R_MASK                        0x0000001F
#define _RPB9R_RPB9R_LENGTH                      0x00000005

#define _RPB10R_RPB10R_POSITION                  0x00000000
#define _RPB10R_RPB10R_MASK                      0x0000001F
#define _RPB10R_RPB10R_LENGTH                    0x00000005

#define _RPB11R_RPB11R_POSITION                  0x00000000
#define _RPB11R_RPB11R_MASK                      0x0000001F
#define _RPB11R_RPB11R_LENGTH                    0x00000005

#define _RPB12R_RPB12R_POSITION                  0x00000000
#define _RPB12R_RPB12R_MASK                      0x0000001F
#define _RPB12R_RPB12R_LENGTH                    0x00000005

#define _RPB13R_RPB13R_POSITION                  0x00000000
#define _RPB13R_RPB13R_MASK                      0x0000001F
#define _RPB13R_RPB13R_LENGTH                    0x00000005

#define _RPB14R_RPB14R_POSITION                  0x00000000
#define _RPB14R_RPB14R_MASK                      0x0000001F
#define _RPB14R_RPB14R_LENGTH                    0x00000005

#define _RPB15R_RPB15R_POSITION                  0x00000000
#define _RPB15R_RPB15R_MASK                      0x0000001F
#define _RPB15R_RPB15R_LENGTH                    0x00000005

#define _RPC0R_RPC0R_POSITION                    0x00000000
#define _RPC0R_RPC0R_MASK                        0x0000001F
#define _RPC0R_RPC0R_LENGTH                      0x00000005

#define _RPC1R_RPC1R_POSITION                    0x00000000
#define _RPC1R_RPC1R_MASK                        0x0000001F
#define _RPC1R_RPC1R_LENGTH                      0x00000005

#define _RPC2R_RPC2R_POSITION                    0x00000000
#define _RPC2R_RPC2R_MASK                        0x0000001F
#define _RPC2R_RPC2R_LENGTH                      0x00000005

#define _RPC4R_RPC4R_POSITION                    0x00000000
#define _RPC4R_RPC4R_MASK                        0x0000001F
#define _RPC4R_RPC4R_LENGTH                      0x00000005

#define _RPC5R_RPC5R_POSITION                    0x00000000
#define _RPC5R_RPC5R_MASK                        0x0000001F
#define _RPC5R_RPC5R_LENGTH                      0x00000005

#define _RPC6R_RPC6R_POSITION                    0x00000000
#define _RPC6R_RPC6R_MASK                        0x0000001F
#define _RPC6R_RPC6R_LENGTH                      0x00000005

#define _RPC7R_RPC7R_POSITION                    0x00000000
#define _RPC7R_RPC7R_MASK                        0x0000001F
#define _RPC7R_RPC7R_LENGTH                      0x00000005

#define _RPC8R_RPC8R_POSITION                    0x00000000
#define _RPC8R_RPC8R_MASK                        0x0000001F
#define _RPC8R_RPC8R_LENGTH                      0x00000005

#define _RPC9R_RPC9R_POSITION                    0x00000000
#define _RPC9R_RPC9R_MASK                        0x0000001F
#define _RPC9R_RPC9R_LENGTH                      0x00000005

#define _RPC10R_RPC10R_POSITION                  0x00000000
#define _RPC10R_RPC10R_MASK                      0x0000001F
#define _RPC10R_RPC10R_LENGTH                    0x00000005

#define _RPC12R_RPC12R_POSITION                  0x00000000
#define _RPC12R_RPC12R_MASK                      0x0000001F
#define _RPC12R_RPC12R_LENGTH                    0x00000005

#define _RPC15R_RPC15R_POSITION                  0x00000000
#define _RPC15R_RPC15R_MASK                      0x0000001F
#define _RPC15R_RPC15R_LENGTH                    0x00000005

#define _RPD3R_RPD3R_POSITION                    0x00000000
#define _RPD3R_RPD3R_MASK                        0x0000001F
#define _RPD3R_RPD3R_LENGTH                      0x00000005

#define _RPD4R_RPD4R_POSITION                    0x00000000
#define _RPD4R_RPD4R_MASK                        0x0000001F
#define _RPD4R_RPD4R_LENGTH                      0x00000005

#define _RPD5R_RPD5R_POSITION                    0x00000000
#define _RPD5R_RPD5R_MASK                        0x0000001F
#define _RPD5R_RPD5R_LENGTH                      0x00000005

#define _RPD6R_RPD6R_POSITION                    0x00000000
#define _RPD6R_RPD6R_MASK                        0x0000001F
#define _RPD6R_RPD6R_LENGTH                      0x00000005

#define _RPE0R_RPE0R_POSITION                    0x00000000
#define _RPE0R_RPE0R_MASK                        0x0000001F
#define _RPE0R_RPE0R_LENGTH                      0x00000005

#define _RPE1R_RPE1R_POSITION                    0x00000000
#define _RPE1R_RPE1R_MASK                        0x0000001F
#define _RPE1R_RPE1R_LENGTH                      0x00000005

#define _RPE14R_RPE14R_POSITION                  0x00000000
#define _RPE14R_RPE14R_MASK                      0x0000001F
#define _RPE14R_RPE14R_LENGTH                    0x00000005

#define _RPE15R_RPE15R_POSITION                  0x00000000
#define _RPE15R_RPE15R_MASK                      0x0000001F
#define _RPE15R_RPE15R_LENGTH                    0x00000005

#define _RPF0R_RPF0R_POSITION                    0x00000000
#define _RPF0R_RPF0R_MASK                        0x0000001F
#define _RPF0R_RPF0R_LENGTH                      0x00000005

#define _RPF1R_RPF1R_POSITION                    0x00000000
#define _RPF1R_RPF1R_MASK                        0x0000001F
#define _RPF1R_RPF1R_LENGTH                      0x00000005

#define _RPG0R_RPG0R_POSITION                    0x00000000
#define _RPG0R_RPG0R_MASK                        0x0000001F
#define _RPG0R_RPG0R_LENGTH                      0x00000005

#define _RPG1R_RPG1R_POSITION                    0x00000000
#define _RPG1R_RPG1R_MASK                        0x0000001F
#define _RPG1R_RPG1R_LENGTH                      0x00000005

