Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _IPC18_DMA0IP_POSITION                   0x00000002
#define _IPC18_DMA0IP_MASK                       0x0000001C
#define _IPC18_DMA0IP_LENGTH                     0x00000003

#define _IPC18_DMA1IS_POSITION                   0x00000008
#define _IPC18_DMA1IS_MASK                       0x00000300
#define _IPC18_DMA1IS_LENGTH                     0x00000002

#define _IPC18_DMA1IP_POSITION                   0x0000000A
#define _IPC18_DMA1IP_MASK                       0x00001C00
#define _IPC18_DMA1IP_LENGTH                     0x00000003

#define _IPC18_DMA2IS_POSITION                   0x00000010
#define _IPC18_DMA2IS_MASK                       0x00030000
#define _IPC18_DMA2IS_LENGTH                     0x00000002

#define _IPC18_DMA2IP_POSITION                   0x00000012
#define _IPC18_DMA2IP_MASK                       0x001C0000
#define _IPC18_DMA2IP_LENGTH                     0x00000003

#define _IPC18_DMA3IS_POSITION                   0x00000018
#define _IPC18_DMA3IS_MASK                       0x03000000
#define _IPC18_DMA3IS_LENGTH                     0x00000002

#define _IPC18_DMA3IP_POSITION                   0x0000001A
#define _IPC18_DMA3IP_MASK                       0x1C000000
#define _IPC18_DMA3IP_LENGTH                     0x00000003

#define _IPC18_w_POSITION                        0x00000000
#define _IPC18_w_MASK                            0xFFFFFFFF
#define _IPC18_w_LENGTH                          0x00000020

#define _IPC19_T6IS_POSITION                     0x00000000
#define _IPC19_T6IS_MASK                         0x00000003
#define _IPC19_T6IS_LENGTH                       0x00000002

#define _IPC19_T6IP_POSITION                     0x00000002
#define _IPC19_T6IP_MASK                         0x0000001C
#define _IPC19_T6IP_LENGTH                       0x00000003

#define _IPC19_IC6EIS_POSITION                   0x00000008
#define _IPC19_IC6EIS_MASK                       0x00000300
#define _IPC19_IC6EIS_LENGTH                     0x00000002

#define _IPC19_IC6EIP_POSITION                   0x0000000A
#define _IPC19_IC6EIP_MASK                       0x00001C00
#define _IPC19_IC6EIP_LENGTH                     0x00000003

#define _IPC19_IC6IS_POSITION                    0x00000010
#define _IPC19_IC6IS_MASK                        0x00030000
#define _IPC19_IC6IS_LENGTH                      0x00000002

#define _IPC19_IC6IP_POSITION                    0x00000012
#define _IPC19_IC6IP_MASK                        0x001C0000
#define _IPC19_IC6IP_LENGTH                      0x00000003

#define _IPC19_OC6IS_POSITION                    0x00000018
#define _IPC19_OC6IS_MASK                        0x03000000
#define _IPC19_OC6IS_LENGTH                      0x00000002

#define _IPC19_OC6IP_POSITION                    0x0000001A
#define _IPC19_OC6IP_MASK                        0x1C000000
#define _IPC19_OC6IP_LENGTH                      0x00000003

#define _IPC19_w_POSITION                        0x00000000
#define _IPC19_w_MASK                            0xFFFFFFFF
#define _IPC19_w_LENGTH                          0x00000020

#define _IPC20_T7IS_POSITION                     0x00000000
#define _IPC20_T7IS_MASK                         0x00000003
#define _IPC20_T7IS_LENGTH                       0x00000002

#define _IPC20_T7IP_POSITION                     0x00000002
#define _IPC20_T7IP_MASK                         0x0000001C
#define _IPC20_T7IP_LENGTH                       0x00000003

#define _IPC20_IC7EIS_POSITION                   0x00000008
#define _IPC20_IC7EIS_MASK                       0x00000300
#define _IPC20_IC7EIS_LENGTH                     0x00000002

#define _IPC20_IC7EIP_POSITION                   0x0000000A
#define _IPC20_IC7EIP_MASK                       0x00001C00
#define _IPC20_IC7EIP_LENGTH                     0x00000003

#define _IPC20_IC7IS_POSITION                    0x00000010
#define _IPC20_IC7IS_MASK                        0x00030000
#define _IPC20_IC7IS_LENGTH                      0x00000002

#define _IPC20_IC7IP_POSITION                    0x00000012
#define _IPC20_IC7IP_MASK                        0x001C0000
#define _IPC20_IC7IP_LENGTH                      0x00000003

#define _IPC20_OC7IS_POSITION                    0x00000018
#define _IPC20_OC7IS_MASK                        0x03000000
#define _IPC20_OC7IS_LENGTH                      0x00000002

#define _IPC20_OC7IP_POSITION                    0x0000001A
#define _IPC20_OC7IP_MASK                        0x1C000000
#define _IPC20_OC7IP_LENGTH                      0x00000003

#define _IPC20_w_POSITION                        0x00000000
#define _IPC20_w_MASK                            0xFFFFFFFF
#define _IPC20_w_LENGTH                          0x00000020

#define _IPC21_T8IS_POSITION                     0x00000000
#define _IPC21_T8IS_MASK                         0x00000003
#define _IPC21_T8IS_LENGTH                       0x00000002

#define _IPC21_T8IP_POSITION                     0x00000002
#define _IPC21_T8IP_MASK                         0x0000001C
#define _IPC21_T8IP_LENGTH                       0x00000003

#define _IPC21_IC8EIS_POSITION                   0x00000008
#define _IPC21_IC8EIS_MASK                       0x00000300
#define _IPC21_IC8EIS_LENGTH                     0x00000002

#define _IPC21_IC8EIP_POSITION                   0x0000000A
#define _IPC21_IC8EIP_MASK                       0x00001C00
#define _IPC21_IC8EIP_LENGTH                     0x00000003

#define _IPC21_IC8IS_POSITION                    0x00000010
#define _IPC21_IC8IS_MASK                        0x00030000
#define _IPC21_IC8IS_LENGTH                      0x00000002

#define _IPC21_IC8IP_POSITION                    0x00000012
#define _IPC21_IC8IP_MASK                        0x001C0000
#define _IPC21_IC8IP_LENGTH                      0x00000003

#define _IPC21_OC8IS_POSITION                    0x00000018
#define _IPC21_OC8IS_MASK                        0x03000000
#define _IPC21_OC8IS_LENGTH                      0x00000002

#define _IPC21_OC8IP_POSITION                    0x0000001A
#define _IPC21_OC8IP_MASK                        0x1C000000
#define _IPC21_OC8IP_LENGTH                      0x00000003

#define _IPC21_w_POSITION                        0x00000000
#define _IPC21_w_MASK                            0xFFFFFFFF
#define _IPC21_w_LENGTH                          0x00000020

#define _IPC22_T9IS_POSITION                     0x00000000
#define _IPC22_T9IS_MASK                         0x00000003
#define _IPC22_T9IS_LENGTH                       0x00000002

