Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD1FIFOSTA28_TFNRFNIF_POSITION         0x00000000
#define _CFD1FIFOSTA28_TFNRFNIF_MASK             0x00000001
#define _CFD1FIFOSTA28_TFNRFNIF_LENGTH           0x00000001

#define _CFD1FIFOSTA28_TFHRFHIF_POSITION         0x00000001
#define _CFD1FIFOSTA28_TFHRFHIF_MASK             0x00000002
#define _CFD1FIFOSTA28_TFHRFHIF_LENGTH           0x00000001

#define _CFD1FIFOSTA28_TFERFFIF_POSITION         0x00000002
#define _CFD1FIFOSTA28_TFERFFIF_MASK             0x00000004
#define _CFD1FIFOSTA28_TFERFFIF_LENGTH           0x00000001

#define _CFD1FIFOSTA28_RXOVIF_POSITION           0x00000003
#define _CFD1FIFOSTA28_RXOVIF_MASK               0x00000008
#define _CFD1FIFOSTA28_RXOVIF_LENGTH             0x00000001

#define _CFD1FIFOSTA28_TXATIF_POSITION           0x00000004
#define _CFD1FIFOSTA28_TXATIF_MASK               0x00000010
#define _CFD1FIFOSTA28_TXATIF_LENGTH             0x00000001

#define _CFD1FIFOSTA28_TXERR_POSITION            0x00000005
#define _CFD1FIFOSTA28_TXERR_MASK                0x00000020
#define _CFD1FIFOSTA28_TXERR_LENGTH              0x00000001

#define _CFD1FIFOSTA28_TXLARB_POSITION           0x00000006
#define _CFD1FIFOSTA28_TXLARB_MASK               0x00000040
#define _CFD1FIFOSTA28_TXLARB_LENGTH             0x00000001

#define _CFD1FIFOSTA28_TXABT_POSITION            0x00000007
#define _CFD1FIFOSTA28_TXABT_MASK                0x00000080
#define _CFD1FIFOSTA28_TXABT_LENGTH              0x00000001

#define _CFD1FIFOSTA28_FIFOCI_POSITION           0x00000008
#define _CFD1FIFOSTA28_FIFOCI_MASK               0x00001F00
#define _CFD1FIFOSTA28_FIFOCI_LENGTH             0x00000005

#define _CFD1FIFOUA28_FIFOUA_POSITION            0x00000000
#define _CFD1FIFOUA28_FIFOUA_MASK                0xFFFFFFFF
#define _CFD1FIFOUA28_FIFOUA_LENGTH              0x00000020

#define _CFD1FIFOCON29_TFNRFNIE_POSITION         0x00000000
#define _CFD1FIFOCON29_TFNRFNIE_MASK             0x00000001
#define _CFD1FIFOCON29_TFNRFNIE_LENGTH           0x00000001

#define _CFD1FIFOCON29_TFHRFHIE_POSITION         0x00000001
#define _CFD1FIFOCON29_TFHRFHIE_MASK             0x00000002
#define _CFD1FIFOCON29_TFHRFHIE_LENGTH           0x00000001

#define _CFD1FIFOCON29_TFERFFIE_POSITION         0x00000002
#define _CFD1FIFOCON29_TFERFFIE_MASK             0x00000004
#define _CFD1FIFOCON29_TFERFFIE_LENGTH           0x00000001

#define _CFD1FIFOCON29_RXOVIE_POSITION           0x00000003
#define _CFD1FIFOCON29_RXOVIE_MASK               0x00000008
#define _CFD1FIFOCON29_RXOVIE_LENGTH             0x00000001

#define _CFD1FIFOCON29_TXATIE_POSITION           0x00000004
#define _CFD1FIFOCON29_TXATIE_MASK               0x00000010
#define _CFD1FIFOCON29_TXATIE_LENGTH             0x00000001

#define _CFD1FIFOCON29_RXTSEN_POSITION           0x00000005
#define _CFD1FIFOCON29_RXTSEN_MASK               0x00000020
#define _CFD1FIFOCON29_RXTSEN_LENGTH             0x00000001

#define _CFD1FIFOCON29_RTREN_POSITION            0x00000006
#define _CFD1FIFOCON29_RTREN_MASK                0x00000040
#define _CFD1FIFOCON29_RTREN_LENGTH              0x00000001

#define _CFD1FIFOCON29_TXEN_POSITION             0x00000007
#define _CFD1FIFOCON29_TXEN_MASK                 0x00000080
#define _CFD1FIFOCON29_TXEN_LENGTH               0x00000001

#define _CFD1FIFOCON29_UINC_POSITION             0x00000008
#define _CFD1FIFOCON29_UINC_MASK                 0x00000100
#define _CFD1FIFOCON29_UINC_LENGTH               0x00000001

#define _CFD1FIFOCON29_TXREQ_POSITION            0x00000009
#define _CFD1FIFOCON29_TXREQ_MASK                0x00000200
#define _CFD1FIFOCON29_TXREQ_LENGTH              0x00000001

#define _CFD1FIFOCON29_FRESET_POSITION           0x0000000A
#define _CFD1FIFOCON29_FRESET_MASK               0x00000400
#define _CFD1FIFOCON29_FRESET_LENGTH             0x00000001

#define _CFD1FIFOCON29_TXPRI_POSITION            0x00000010
#define _CFD1FIFOCON29_TXPRI_MASK                0x001F0000
#define _CFD1FIFOCON29_TXPRI_LENGTH              0x00000005

#define _CFD1FIFOCON29_TXAT_POSITION             0x00000015
#define _CFD1FIFOCON29_TXAT_MASK                 0x00600000
#define _CFD1FIFOCON29_TXAT_LENGTH               0x00000002

#define _CFD1FIFOCON29_FSIZE_POSITION            0x00000018
#define _CFD1FIFOCON29_FSIZE_MASK                0x1F000000
#define _CFD1FIFOCON29_FSIZE_LENGTH              0x00000005

#define _CFD1FIFOCON29_PLSIZE_POSITION           0x0000001D
#define _CFD1FIFOCON29_PLSIZE_MASK               0xE0000000
#define _CFD1FIFOCON29_PLSIZE_LENGTH             0x00000003

#define _CFD1FIFOSTA29_TFNRFNIF_POSITION         0x00000000
#define _CFD1FIFOSTA29_TFNRFNIF_MASK             0x00000001
#define _CFD1FIFOSTA29_TFNRFNIF_LENGTH           0x00000001

#define _CFD1FIFOSTA29_TFHRFHIF_POSITION         0x00000001
#define _CFD1FIFOSTA29_TFHRFHIF_MASK             0x00000002
#define _CFD1FIFOSTA29_TFHRFHIF_LENGTH           0x00000001

#define _CFD1FIFOSTA29_TFERFFIF_POSITION         0x00000002
#define _CFD1FIFOSTA29_TFERFFIF_MASK             0x00000004
#define _CFD1FIFOSTA29_TFERFFIF_LENGTH           0x00000001

#define _CFD1FIFOSTA29_RXOVIF_POSITION           0x00000003
#define _CFD1FIFOSTA29_RXOVIF_MASK               0x00000008
#define _CFD1FIFOSTA29_RXOVIF_LENGTH             0x00000001

#define _CFD1FIFOSTA29_TXATIF_POSITION           0x00000004
#define _CFD1FIFOSTA29_TXATIF_MASK               0x00000010
#define _CFD1FIFOSTA29_TXATIF_LENGTH             0x00000001

#define _CFD1FIFOSTA29_TXERR_POSITION            0x00000005
#define _CFD1FIFOSTA29_TXERR_MASK                0x00000020
#define _CFD1FIFOSTA29_TXERR_LENGTH              0x00000001

#define _CFD1FIFOSTA29_TXLARB_POSITION           0x00000006
#define _CFD1FIFOSTA29_TXLARB_MASK               0x00000040
#define _CFD1FIFOSTA29_TXLARB_LENGTH             0x00000001

#define _CFD1FIFOSTA29_TXABT_POSITION            0x00000007
#define _CFD1FIFOSTA29_TXABT_MASK                0x00000080
#define _CFD1FIFOSTA29_TXABT_LENGTH              0x00000001

#define _CFD1FIFOSTA29_FIFOCI_POSITION           0x00000008
#define _CFD1FIFOSTA29_FIFOCI_MASK               0x00001F00
#define _CFD1FIFOSTA29_FIFOCI_LENGTH             0x00000005

#define _CFD1FIFOUA29_FIFOUA_POSITION            0x00000000
#define _CFD1FIFOUA29_FIFOUA_MASK                0xFFFFFFFF
#define _CFD1FIFOUA29_FIFOUA_LENGTH              0x00000020

#define _CFD1FIFOCON30_TFNRFNIE_POSITION         0x00000000
#define _CFD1FIFOCON30_TFNRFNIE_MASK             0x00000001
#define _CFD1FIFOCON30_TFNRFNIE_LENGTH           0x00000001

#define _CFD1FIFOCON30_TFHRFHIE_POSITION         0x00000001
#define _CFD1FIFOCON30_TFHRFHIE_MASK             0x00000002
#define _CFD1FIFOCON30_TFHRFHIE_LENGTH           0x00000001

