Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD1MASK30_MEID_POSITION                0x0000000B
#define _CFD1MASK30_MEID_MASK                    0x1FFFF800
#define _CFD1MASK30_MEID_LENGTH                  0x00000012

#define _CFD1MASK30_MSID11_POSITION              0x0000001D
#define _CFD1MASK30_MSID11_MASK                  0x20000000
#define _CFD1MASK30_MSID11_LENGTH                0x00000001

#define _CFD1MASK30_MIDE_POSITION                0x0000001E
#define _CFD1MASK30_MIDE_MASK                    0x40000000
#define _CFD1MASK30_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ31_SID_POSITION               0x00000000
#define _CFD1FLTOBJ31_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ31_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ31_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ31_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ31_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ31_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ31_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ31_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ31_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ31_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ31_EXIDE_LENGTH               0x00000001

#define _CFD1MASK31_MSID_POSITION                0x00000000
#define _CFD1MASK31_MSID_MASK                    0x000007FF
#define _CFD1MASK31_MSID_LENGTH                  0x0000000B

#define _CFD1MASK31_MEID_POSITION                0x0000000B
#define _CFD1MASK31_MEID_MASK                    0x1FFFF800
#define _CFD1MASK31_MEID_LENGTH                  0x00000012

#define _CFD1MASK31_MSID11_POSITION              0x0000001D
#define _CFD1MASK31_MSID11_MASK                  0x20000000
#define _CFD1MASK31_MSID11_LENGTH                0x00000001

#define _CFD1MASK31_MIDE_POSITION                0x0000001E
#define _CFD1MASK31_MIDE_MASK                    0x40000000
#define _CFD1MASK31_MIDE_LENGTH                  0x00000001

#define _CFD2CON_DNCNT_POSITION                  0x00000000
#define _CFD2CON_DNCNT_MASK                      0x0000001F
#define _CFD2CON_DNCNT_LENGTH                    0x00000005

#define _CFD2CON_ISOCRCEN_POSITION               0x00000005
#define _CFD2CON_ISOCRCEN_MASK                   0x00000020
#define _CFD2CON_ISOCRCEN_LENGTH                 0x00000001

#define _CFD2CON_PXEDIS_POSITION                 0x00000006
#define _CFD2CON_PXEDIS_MASK                     0x00000040
#define _CFD2CON_PXEDIS_LENGTH                   0x00000001

#define _CFD2CON_CLKSEL0_POSITION                0x00000007
#define _CFD2CON_CLKSEL0_MASK                    0x00000080
#define _CFD2CON_CLKSEL0_LENGTH                  0x00000001

#define _CFD2CON_WAKFIL_POSITION                 0x00000008
#define _CFD2CON_WAKFIL_MASK                     0x00000100
#define _CFD2CON_WAKFIL_LENGTH                   0x00000001

#define _CFD2CON_WFT_POSITION                    0x00000009
#define _CFD2CON_WFT_MASK                        0x00000600
#define _CFD2CON_WFT_LENGTH                      0x00000002

#define _CFD2CON_BUSY_POSITION                   0x0000000B
#define _CFD2CON_BUSY_MASK                       0x00000800
#define _CFD2CON_BUSY_LENGTH                     0x00000001

#define _CFD2CON_BRSDIS_POSITION                 0x0000000C
#define _CFD2CON_BRSDIS_MASK                     0x00001000
#define _CFD2CON_BRSDIS_LENGTH                   0x00000001

#define _CFD2CON_SIDL_POSITION                   0x0000000D
#define _CFD2CON_SIDL_MASK                       0x00002000
#define _CFD2CON_SIDL_LENGTH                     0x00000001

#define _CFD2CON_ON_POSITION                     0x0000000F
#define _CFD2CON_ON_MASK                         0x00008000
#define _CFD2CON_ON_LENGTH                       0x00000001

#define _CFD2CON_RTXAT_POSITION                  0x00000010
#define _CFD2CON_RTXAT_MASK                      0x00010000
#define _CFD2CON_RTXAT_LENGTH                    0x00000001

#define _CFD2CON_ESIGM_POSITION                  0x00000011
#define _CFD2CON_ESIGM_MASK                      0x00020000
#define _CFD2CON_ESIGM_LENGTH                    0x00000001

#define _CFD2CON_SERR2LOM_POSITION               0x00000012
#define _CFD2CON_SERR2LOM_MASK                   0x00040000
#define _CFD2CON_SERR2LOM_LENGTH                 0x00000001

#define _CFD2CON_STEF_POSITION                   0x00000013
#define _CFD2CON_STEF_MASK                       0x00080000
#define _CFD2CON_STEF_LENGTH                     0x00000001

#define _CFD2CON_TXQEN_POSITION                  0x00000014
#define _CFD2CON_TXQEN_MASK                      0x00100000
#define _CFD2CON_TXQEN_LENGTH                    0x00000001

#define _CFD2CON_OPMOD_POSITION                  0x00000015
#define _CFD2CON_OPMOD_MASK                      0x00E00000
#define _CFD2CON_OPMOD_LENGTH                    0x00000003

#define _CFD2CON_REQOP_POSITION                  0x00000018
#define _CFD2CON_REQOP_MASK                      0x07000000
#define _CFD2CON_REQOP_LENGTH                    0x00000003

#define _CFD2CON_ABAT_POSITION                   0x0000001B
#define _CFD2CON_ABAT_MASK                       0x08000000
#define _CFD2CON_ABAT_LENGTH                     0x00000001

#define _CFD2CON_TXBWS_POSITION                  0x0000001C
#define _CFD2CON_TXBWS_MASK                      0xF0000000
#define _CFD2CON_TXBWS_LENGTH                    0x00000004

#define _CFD2CON_w_POSITION                      0x00000000
#define _CFD2CON_w_MASK                          0xFFFFFFFF
#define _CFD2CON_w_LENGTH                        0x00000020

#define _CFD2NBTCFG_SJW_POSITION                 0x00000000
#define _CFD2NBTCFG_SJW_MASK                     0x0000007F
#define _CFD2NBTCFG_SJW_LENGTH                   0x00000007

#define _CFD2NBTCFG_TSEG2_POSITION               0x00000008
#define _CFD2NBTCFG_TSEG2_MASK                   0x00007F00
#define _CFD2NBTCFG_TSEG2_LENGTH                 0x00000007

#define _CFD2NBTCFG_TSEG1_POSITION               0x00000010
#define _CFD2NBTCFG_TSEG1_MASK                   0x00FF0000
#define _CFD2NBTCFG_TSEG1_LENGTH                 0x00000008

#define _CFD2NBTCFG_BRP_POSITION                 0x00000018
#define _CFD2NBTCFG_BRP_MASK                     0xFF000000
#define _CFD2NBTCFG_BRP_LENGTH                   0x00000008

#define _CFD2DBTCFG_SJW_POSITION                 0x00000000
#define _CFD2DBTCFG_SJW_MASK                     0x0000000F
#define _CFD2DBTCFG_SJW_LENGTH                   0x00000004

#define _CFD2DBTCFG_TSEG2_POSITION               0x00000008
#define _CFD2DBTCFG_TSEG2_MASK                   0x00000F00
#define _CFD2DBTCFG_TSEG2_LENGTH                 0x00000004

#define _CFD2DBTCFG_TSEG1_POSITION               0x00000010
#define _CFD2DBTCFG_TSEG1_MASK                   0x001F0000
#define _CFD2DBTCFG_TSEG1_LENGTH                 0x00000005

#define _CFD2DBTCFG_BRP_POSITION                 0x00000018
#define _CFD2DBTCFG_BRP_MASK                     0xFF000000
#define _CFD2DBTCFG_BRP_LENGTH                   0x00000008

#define _CFD2TDC_TDCV_POSITION                   0x00000000
#define _CFD2TDC_TDCV_MASK                       0x0000003F
#define _CFD2TDC_TDCV_LENGTH                     0x00000006

#define _CFD2TDC_TDCO_POSITION                   0x00000008
#define _CFD2TDC_TDCO_MASK                       0x00007F00
#define _CFD2TDC_TDCO_LENGTH                     0x00000007

#define _CFD2TDC_TDCMOD_POSITION                 0x00000010
#define _CFD2TDC_TDCMOD_MASK                     0x00030000
#define _CFD2TDC_TDCMOD_LENGTH                   0x00000002

#define _CFD2TDC_SID11EN_POSITION                0x00000018
#define _CFD2TDC_SID11EN_MASK                    0x01000000
#define _CFD2TDC_SID11EN_LENGTH                  0x00000001

#define _CFD2TDC_EDGFLTEN_POSITION               0x00000019
#define _CFD2TDC_EDGFLTEN_MASK                   0x02000000
#define _CFD2TDC_EDGFLTEN_LENGTH                 0x00000001

