Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD3BDIAG1_EFMSGCNT_POSITION            0x00000000
#define _CFD3BDIAG1_EFMSGCNT_MASK                0x0000FFFF
#define _CFD3BDIAG1_EFMSGCNT_LENGTH              0x00000010

#define _CFD3BDIAG1_NBIT0ERR_POSITION            0x00000010
#define _CFD3BDIAG1_NBIT0ERR_MASK                0x00010000
#define _CFD3BDIAG1_NBIT0ERR_LENGTH              0x00000001

#define _CFD3BDIAG1_NBIT1ERR_POSITION            0x00000011
#define _CFD3BDIAG1_NBIT1ERR_MASK                0x00020000
#define _CFD3BDIAG1_NBIT1ERR_LENGTH              0x00000001

#define _CFD3BDIAG1_NACKERR_POSITION             0x00000012
#define _CFD3BDIAG1_NACKERR_MASK                 0x00040000
#define _CFD3BDIAG1_NACKERR_LENGTH               0x00000001

#define _CFD3BDIAG1_NFORMERR_POSITION            0x00000013
#define _CFD3BDIAG1_NFORMERR_MASK                0x00080000
#define _CFD3BDIAG1_NFORMERR_LENGTH              0x00000001

#define _CFD3BDIAG1_NSTUFERR_POSITION            0x00000014
#define _CFD3BDIAG1_NSTUFERR_MASK                0x00100000
#define _CFD3BDIAG1_NSTUFERR_LENGTH              0x00000001

#define _CFD3BDIAG1_NCRCERR_POSITION             0x00000015
#define _CFD3BDIAG1_NCRCERR_MASK                 0x00200000
#define _CFD3BDIAG1_NCRCERR_LENGTH               0x00000001

#define _CFD3BDIAG1_DBIT0ERR_POSITION            0x00000018
#define _CFD3BDIAG1_DBIT0ERR_MASK                0x01000000
#define _CFD3BDIAG1_DBIT0ERR_LENGTH              0x00000001

#define _CFD3BDIAG1_DBIT1ERR_POSITION            0x00000019
#define _CFD3BDIAG1_DBIT1ERR_MASK                0x02000000
#define _CFD3BDIAG1_DBIT1ERR_LENGTH              0x00000001

#define _CFD3BDIAG1_DFORMERR_POSITION            0x0000001B
#define _CFD3BDIAG1_DFORMERR_MASK                0x08000000
#define _CFD3BDIAG1_DFORMERR_LENGTH              0x00000001

#define _CFD3BDIAG1_DSTUFERR_POSITION            0x0000001C
#define _CFD3BDIAG1_DSTUFERR_MASK                0x10000000
#define _CFD3BDIAG1_DSTUFERR_LENGTH              0x00000001

#define _CFD3BDIAG1_DCRCERR_POSITION             0x0000001D
#define _CFD3BDIAG1_DCRCERR_MASK                 0x20000000
#define _CFD3BDIAG1_DCRCERR_LENGTH               0x00000001

#define _CFD3BDIAG1_ESI_POSITION                 0x0000001E
#define _CFD3BDIAG1_ESI_MASK                     0x40000000
#define _CFD3BDIAG1_ESI_LENGTH                   0x00000001

#define _CFD3BDIAG1_DLCMM_POSITION               0x0000001F
#define _CFD3BDIAG1_DLCMM_MASK                   0x80000000
#define _CFD3BDIAG1_DLCMM_LENGTH                 0x00000001

#define _CFD3TEFCON_TEFNEIE_POSITION             0x00000000
#define _CFD3TEFCON_TEFNEIE_MASK                 0x00000001
#define _CFD3TEFCON_TEFNEIE_LENGTH               0x00000001

#define _CFD3TEFCON_TEFHIE_POSITION              0x00000001
#define _CFD3TEFCON_TEFHIE_MASK                  0x00000002
#define _CFD3TEFCON_TEFHIE_LENGTH                0x00000001

#define _CFD3TEFCON_TEFFIE_POSITION              0x00000002
#define _CFD3TEFCON_TEFFIE_MASK                  0x00000004
#define _CFD3TEFCON_TEFFIE_LENGTH                0x00000001

#define _CFD3TEFCON_TEFOVIE_POSITION             0x00000003
#define _CFD3TEFCON_TEFOVIE_MASK                 0x00000008
#define _CFD3TEFCON_TEFOVIE_LENGTH               0x00000001

#define _CFD3TEFCON_TEFTSEN_POSITION             0x00000005
#define _CFD3TEFCON_TEFTSEN_MASK                 0x00000020
#define _CFD3TEFCON_TEFTSEN_LENGTH               0x00000001

#define _CFD3TEFCON_UINC_POSITION                0x00000008
#define _CFD3TEFCON_UINC_MASK                    0x00000100
#define _CFD3TEFCON_UINC_LENGTH                  0x00000001

#define _CFD3TEFCON_FRESET_POSITION              0x0000000A
#define _CFD3TEFCON_FRESET_MASK                  0x00000400
#define _CFD3TEFCON_FRESET_LENGTH                0x00000001

#define _CFD3TEFCON_FSIZE_POSITION               0x00000018
#define _CFD3TEFCON_FSIZE_MASK                   0x1F000000
#define _CFD3TEFCON_FSIZE_LENGTH                 0x00000005

#define _CFD3TEFSTA_TEFNEIF_POSITION             0x00000000
#define _CFD3TEFSTA_TEFNEIF_MASK                 0x00000001
#define _CFD3TEFSTA_TEFNEIF_LENGTH               0x00000001

#define _CFD3TEFSTA_TEFHIF_POSITION              0x00000001
#define _CFD3TEFSTA_TEFHIF_MASK                  0x00000002
#define _CFD3TEFSTA_TEFHIF_LENGTH                0x00000001

#define _CFD3TEFSTA_TEFFIF_POSITION              0x00000002
#define _CFD3TEFSTA_TEFFIF_MASK                  0x00000004
#define _CFD3TEFSTA_TEFFIF_LENGTH                0x00000001

#define _CFD3TEFSTA_TEFOVIF_POSITION             0x00000003
#define _CFD3TEFSTA_TEFOVIF_MASK                 0x00000008
#define _CFD3TEFSTA_TEFOVIF_LENGTH               0x00000001

#define _CFD3TEFUA_TEFUA_POSITION                0x00000000
#define _CFD3TEFUA_TEFUA_MASK                    0xFFFFFFFF
#define _CFD3TEFUA_TEFUA_LENGTH                  0x00000020

#define _CFD3FIFOBA_FIFOBA_POSITION              0x00000000
#define _CFD3FIFOBA_FIFOBA_MASK                  0xFFFFFFFF
#define _CFD3FIFOBA_FIFOBA_LENGTH                0x00000020

#define _CFD3TXQCON_TXQNIE_POSITION              0x00000000
#define _CFD3TXQCON_TXQNIE_MASK                  0x00000001
#define _CFD3TXQCON_TXQNIE_LENGTH                0x00000001

#define _CFD3TXQCON_TXQEIE_POSITION              0x00000002
#define _CFD3TXQCON_TXQEIE_MASK                  0x00000004
#define _CFD3TXQCON_TXQEIE_LENGTH                0x00000001

#define _CFD3TXQCON_TXATIE_POSITION              0x00000004
#define _CFD3TXQCON_TXATIE_MASK                  0x00000010
#define _CFD3TXQCON_TXATIE_LENGTH                0x00000001

#define _CFD3TXQCON_TXEN_POSITION                0x00000007
#define _CFD3TXQCON_TXEN_MASK                    0x00000080
#define _CFD3TXQCON_TXEN_LENGTH                  0x00000001

#define _CFD3TXQCON_UINC_POSITION                0x00000008
#define _CFD3TXQCON_UINC_MASK                    0x00000100
#define _CFD3TXQCON_UINC_LENGTH                  0x00000001

#define _CFD3TXQCON_TXREQ_POSITION               0x00000009
#define _CFD3TXQCON_TXREQ_MASK                   0x00000200
#define _CFD3TXQCON_TXREQ_LENGTH                 0x00000001

#define _CFD3TXQCON_FRESET_POSITION              0x0000000A
#define _CFD3TXQCON_FRESET_MASK                  0x00000400
#define _CFD3TXQCON_FRESET_LENGTH                0x00000001

#define _CFD3TXQCON_TXPRI_POSITION               0x00000010
#define _CFD3TXQCON_TXPRI_MASK                   0x001F0000
#define _CFD3TXQCON_TXPRI_LENGTH                 0x00000005

#define _CFD3TXQCON_TXAT_POSITION                0x00000015
#define _CFD3TXQCON_TXAT_MASK                    0x00600000
#define _CFD3TXQCON_TXAT_LENGTH                  0x00000002

#define _CFD3TXQCON_FSIZE_POSITION               0x00000018
#define _CFD3TXQCON_FSIZE_MASK                   0x1F000000
#define _CFD3TXQCON_FSIZE_LENGTH                 0x00000005

#define _CFD3TXQCON_PLSIZE_POSITION              0x0000001D
#define _CFD3TXQCON_PLSIZE_MASK                  0xE0000000
#define _CFD3TXQCON_PLSIZE_LENGTH                0x00000003

#define _CFD3TXQSTA_TXQNIF_POSITION              0x00000000
#define _CFD3TXQSTA_TXQNIF_MASK                  0x00000001
#define _CFD3TXQSTA_TXQNIF_LENGTH                0x00000001

#define _CFD3TXQSTA_TXQEIF_POSITION              0x00000002
#define _CFD3TXQSTA_TXQEIF_MASK                  0x00000004
#define _CFD3TXQSTA_TXQEIF_LENGTH                0x00000001

#define _CFD3TXQSTA_TXATIF_POSITION              0x00000004
#define _CFD3TXQSTA_TXATIF_MASK                  0x00000010
#define _CFD3TXQSTA_TXATIF_LENGTH                0x00000001

#define _CFD3TXQSTA_TXERR_POSITION               0x00000005
#define _CFD3TXQSTA_TXERR_MASK                   0x00000020
#define _CFD3TXQSTA_TXERR_LENGTH                 0x00000001

