Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD3FIFOCON15_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON15_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON15_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON15_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON15_RTREN_MASK                0x00000040
#define _CFD3FIFOCON15_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON15_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON15_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON15_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON15_UINC_POSITION             0x00000008
#define _CFD3FIFOCON15_UINC_MASK                 0x00000100
#define _CFD3FIFOCON15_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON15_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON15_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON15_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON15_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON15_FRESET_MASK               0x00000400
#define _CFD3FIFOCON15_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON15_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON15_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON15_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON15_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON15_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON15_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON15_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON15_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON15_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON15_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON15_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON15_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA15_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA15_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA15_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA15_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA15_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA15_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA15_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA15_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA15_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA15_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA15_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA15_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA15_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA15_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA15_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA15_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA15_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA15_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA15_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA15_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA15_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA15_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA15_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA15_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA15_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA15_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA15_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA15_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA15_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA15_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON16_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON16_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON16_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON16_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON16_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON16_TFHRFHIE_LENGTH           0x00000001

#define _CFD3FIFOCON16_TFERFFIE_POSITION         0x00000002
#define _CFD3FIFOCON16_TFERFFIE_MASK             0x00000004
#define _CFD3FIFOCON16_TFERFFIE_LENGTH           0x00000001

#define _CFD3FIFOCON16_RXOVIE_POSITION           0x00000003
#define _CFD3FIFOCON16_RXOVIE_MASK               0x00000008
#define _CFD3FIFOCON16_RXOVIE_LENGTH             0x00000001

#define _CFD3FIFOCON16_TXATIE_POSITION           0x00000004
#define _CFD3FIFOCON16_TXATIE_MASK               0x00000010
#define _CFD3FIFOCON16_TXATIE_LENGTH             0x00000001

#define _CFD3FIFOCON16_RXTSEN_POSITION           0x00000005
#define _CFD3FIFOCON16_RXTSEN_MASK               0x00000020
#define _CFD3FIFOCON16_RXTSEN_LENGTH             0x00000001

#define _CFD3FIFOCON16_RTREN_POSITION            0x00000006
#define _CFD3FIFOCON16_RTREN_MASK                0x00000040
#define _CFD3FIFOCON16_RTREN_LENGTH              0x00000001

#define _CFD3FIFOCON16_TXEN_POSITION             0x00000007
#define _CFD3FIFOCON16_TXEN_MASK                 0x00000080
#define _CFD3FIFOCON16_TXEN_LENGTH               0x00000001

#define _CFD3FIFOCON16_UINC_POSITION             0x00000008
#define _CFD3FIFOCON16_UINC_MASK                 0x00000100
#define _CFD3FIFOCON16_UINC_LENGTH               0x00000001

#define _CFD3FIFOCON16_TXREQ_POSITION            0x00000009
#define _CFD3FIFOCON16_TXREQ_MASK                0x00000200
#define _CFD3FIFOCON16_TXREQ_LENGTH              0x00000001

#define _CFD3FIFOCON16_FRESET_POSITION           0x0000000A
#define _CFD3FIFOCON16_FRESET_MASK               0x00000400
#define _CFD3FIFOCON16_FRESET_LENGTH             0x00000001

#define _CFD3FIFOCON16_TXPRI_POSITION            0x00000010
#define _CFD3FIFOCON16_TXPRI_MASK                0x001F0000
#define _CFD3FIFOCON16_TXPRI_LENGTH              0x00000005

#define _CFD3FIFOCON16_TXAT_POSITION             0x00000015
#define _CFD3FIFOCON16_TXAT_MASK                 0x00600000
#define _CFD3FIFOCON16_TXAT_LENGTH               0x00000002

#define _CFD3FIFOCON16_FSIZE_POSITION            0x00000018
#define _CFD3FIFOCON16_FSIZE_MASK                0x1F000000
#define _CFD3FIFOCON16_FSIZE_LENGTH              0x00000005

#define _CFD3FIFOCON16_PLSIZE_POSITION           0x0000001D
#define _CFD3FIFOCON16_PLSIZE_MASK               0xE0000000
#define _CFD3FIFOCON16_PLSIZE_LENGTH             0x00000003

#define _CFD3FIFOSTA16_TFNRFNIF_POSITION         0x00000000
#define _CFD3FIFOSTA16_TFNRFNIF_MASK             0x00000001
#define _CFD3FIFOSTA16_TFNRFNIF_LENGTH           0x00000001

#define _CFD3FIFOSTA16_TFHRFHIF_POSITION         0x00000001
#define _CFD3FIFOSTA16_TFHRFHIF_MASK             0x00000002
#define _CFD3FIFOSTA16_TFHRFHIF_LENGTH           0x00000001

#define _CFD3FIFOSTA16_TFERFFIF_POSITION         0x00000002
#define _CFD3FIFOSTA16_TFERFFIF_MASK             0x00000004
#define _CFD3FIFOSTA16_TFERFFIF_LENGTH           0x00000001

#define _CFD3FIFOSTA16_RXOVIF_POSITION           0x00000003
#define _CFD3FIFOSTA16_RXOVIF_MASK               0x00000008
#define _CFD3FIFOSTA16_RXOVIF_LENGTH             0x00000001

#define _CFD3FIFOSTA16_TXATIF_POSITION           0x00000004
#define _CFD3FIFOSTA16_TXATIF_MASK               0x00000010
#define _CFD3FIFOSTA16_TXATIF_LENGTH             0x00000001

#define _CFD3FIFOSTA16_TXERR_POSITION            0x00000005
#define _CFD3FIFOSTA16_TXERR_MASK                0x00000020
#define _CFD3FIFOSTA16_TXERR_LENGTH              0x00000001

#define _CFD3FIFOSTA16_TXLARB_POSITION           0x00000006
#define _CFD3FIFOSTA16_TXLARB_MASK               0x00000040
#define _CFD3FIFOSTA16_TXLARB_LENGTH             0x00000001

#define _CFD3FIFOSTA16_TXABT_POSITION            0x00000007
#define _CFD3FIFOSTA16_TXABT_MASK                0x00000080
#define _CFD3FIFOSTA16_TXABT_LENGTH              0x00000001

#define _CFD3FIFOSTA16_FIFOCI_POSITION           0x00000008
#define _CFD3FIFOSTA16_FIFOCI_MASK               0x00001F00
#define _CFD3FIFOSTA16_FIFOCI_LENGTH             0x00000005

#define _CFD3FIFOUA16_FIFOUA_POSITION            0x00000000
#define _CFD3FIFOUA16_FIFOUA_MASK                0xFFFFFFFF
#define _CFD3FIFOUA16_FIFOUA_LENGTH              0x00000020

#define _CFD3FIFOCON17_TFNRFNIE_POSITION         0x00000000
#define _CFD3FIFOCON17_TFNRFNIE_MASK             0x00000001
#define _CFD3FIFOCON17_TFNRFNIE_LENGTH           0x00000001

#define _CFD3FIFOCON17_TFHRFHIE_POSITION         0x00000001
#define _CFD3FIFOCON17_TFHRFHIE_MASK             0x00000002
#define _CFD3FIFOCON17_TFHRFHIE_LENGTH           0x00000001

