Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD3FLTCON4_FLTEN16_POSITION            0x00000007
#define _CFD3FLTCON4_FLTEN16_MASK                0x00000080
#define _CFD3FLTCON4_FLTEN16_LENGTH              0x00000001

#define _CFD3FLTCON4_F17BP_POSITION              0x00000008
#define _CFD3FLTCON4_F17BP_MASK                  0x00001F00
#define _CFD3FLTCON4_F17BP_LENGTH                0x00000005

#define _CFD3FLTCON4_FLTEN17_POSITION            0x0000000F
#define _CFD3FLTCON4_FLTEN17_MASK                0x00008000
#define _CFD3FLTCON4_FLTEN17_LENGTH              0x00000001

#define _CFD3FLTCON4_F18BP_POSITION              0x00000010
#define _CFD3FLTCON4_F18BP_MASK                  0x001F0000
#define _CFD3FLTCON4_F18BP_LENGTH                0x00000005

#define _CFD3FLTCON4_FLTEN18_POSITION            0x00000017
#define _CFD3FLTCON4_FLTEN18_MASK                0x00800000
#define _CFD3FLTCON4_FLTEN18_LENGTH              0x00000001

#define _CFD3FLTCON4_F19BP_POSITION              0x00000018
#define _CFD3FLTCON4_F19BP_MASK                  0x1F000000
#define _CFD3FLTCON4_F19BP_LENGTH                0x00000005

#define _CFD3FLTCON4_FLTEN19_POSITION            0x0000001F
#define _CFD3FLTCON4_FLTEN19_MASK                0x80000000
#define _CFD3FLTCON4_FLTEN19_LENGTH              0x00000001

#define _CFD3FLTCON5_F20BP_POSITION              0x00000000
#define _CFD3FLTCON5_F20BP_MASK                  0x0000001F
#define _CFD3FLTCON5_F20BP_LENGTH                0x00000005

#define _CFD3FLTCON5_FLTEN20_POSITION            0x00000007
#define _CFD3FLTCON5_FLTEN20_MASK                0x00000080
#define _CFD3FLTCON5_FLTEN20_LENGTH              0x00000001

#define _CFD3FLTCON5_F21BP_POSITION              0x00000008
#define _CFD3FLTCON5_F21BP_MASK                  0x00001F00
#define _CFD3FLTCON5_F21BP_LENGTH                0x00000005

#define _CFD3FLTCON5_FLTEN21_POSITION            0x0000000F
#define _CFD3FLTCON5_FLTEN21_MASK                0x00008000
#define _CFD3FLTCON5_FLTEN21_LENGTH              0x00000001

#define _CFD3FLTCON5_F22BP_POSITION              0x00000010
#define _CFD3FLTCON5_F22BP_MASK                  0x001F0000
#define _CFD3FLTCON5_F22BP_LENGTH                0x00000005

#define _CFD3FLTCON5_FLTEN22_POSITION            0x00000017
#define _CFD3FLTCON5_FLTEN22_MASK                0x00800000
#define _CFD3FLTCON5_FLTEN22_LENGTH              0x00000001

#define _CFD3FLTCON5_F23BP_POSITION              0x00000018
#define _CFD3FLTCON5_F23BP_MASK                  0x1F000000
#define _CFD3FLTCON5_F23BP_LENGTH                0x00000005

#define _CFD3FLTCON5_FLTEN23_POSITION            0x0000001F
#define _CFD3FLTCON5_FLTEN23_MASK                0x80000000
#define _CFD3FLTCON5_FLTEN23_LENGTH              0x00000001

#define _CFD3FLTCON6_F24BP_POSITION              0x00000000
#define _CFD3FLTCON6_F24BP_MASK                  0x0000001F
#define _CFD3FLTCON6_F24BP_LENGTH                0x00000005

#define _CFD3FLTCON6_FLTEN24_POSITION            0x00000007
#define _CFD3FLTCON6_FLTEN24_MASK                0x00000080
#define _CFD3FLTCON6_FLTEN24_LENGTH              0x00000001

#define _CFD3FLTCON6_F25BP_POSITION              0x00000008
#define _CFD3FLTCON6_F25BP_MASK                  0x00001F00
#define _CFD3FLTCON6_F25BP_LENGTH                0x00000005

#define _CFD3FLTCON6_FLTEN25_POSITION            0x0000000F
#define _CFD3FLTCON6_FLTEN25_MASK                0x00008000
#define _CFD3FLTCON6_FLTEN25_LENGTH              0x00000001

#define _CFD3FLTCON6_F26BP_POSITION              0x00000010
#define _CFD3FLTCON6_F26BP_MASK                  0x001F0000
#define _CFD3FLTCON6_F26BP_LENGTH                0x00000005

#define _CFD3FLTCON6_FLTEN26_POSITION            0x00000017
#define _CFD3FLTCON6_FLTEN26_MASK                0x00800000
#define _CFD3FLTCON6_FLTEN26_LENGTH              0x00000001

#define _CFD3FLTCON6_F27BP_POSITION              0x00000018
#define _CFD3FLTCON6_F27BP_MASK                  0x1F000000
#define _CFD3FLTCON6_F27BP_LENGTH                0x00000005

#define _CFD3FLTCON6_FLTEN27_POSITION            0x0000001F
#define _CFD3FLTCON6_FLTEN27_MASK                0x80000000
#define _CFD3FLTCON6_FLTEN27_LENGTH              0x00000001

#define _CFD3FLTCON7_F28BP_POSITION              0x00000000
#define _CFD3FLTCON7_F28BP_MASK                  0x0000001F
#define _CFD3FLTCON7_F28BP_LENGTH                0x00000005

#define _CFD3FLTCON7_FLTEN28_POSITION            0x00000007
#define _CFD3FLTCON7_FLTEN28_MASK                0x00000080
#define _CFD3FLTCON7_FLTEN28_LENGTH              0x00000001

#define _CFD3FLTCON7_F29BP_POSITION              0x00000008
#define _CFD3FLTCON7_F29BP_MASK                  0x00001F00
#define _CFD3FLTCON7_F29BP_LENGTH                0x00000005

#define _CFD3FLTCON7_FLTEN29_POSITION            0x0000000F
#define _CFD3FLTCON7_FLTEN29_MASK                0x00008000
#define _CFD3FLTCON7_FLTEN29_LENGTH              0x00000001

#define _CFD3FLTCON7_F30BP_POSITION              0x00000010
#define _CFD3FLTCON7_F30BP_MASK                  0x001F0000
#define _CFD3FLTCON7_F30BP_LENGTH                0x00000005

#define _CFD3FLTCON7_FLTEN30_POSITION            0x00000017
#define _CFD3FLTCON7_FLTEN30_MASK                0x00800000
#define _CFD3FLTCON7_FLTEN30_LENGTH              0x00000001

#define _CFD3FLTCON7_F31BP_POSITION              0x00000018
#define _CFD3FLTCON7_F31BP_MASK                  0x1F000000
#define _CFD3FLTCON7_F31BP_LENGTH                0x00000005

#define _CFD3FLTCON7_FLTEN31_POSITION            0x0000001F
#define _CFD3FLTCON7_FLTEN31_MASK                0x80000000
#define _CFD3FLTCON7_FLTEN31_LENGTH              0x00000001

#define _CFD3FLTOBJ0_SID_POSITION                0x00000000
#define _CFD3FLTOBJ0_SID_MASK                    0x000007FF
#define _CFD3FLTOBJ0_SID_LENGTH                  0x0000000B

#define _CFD3FLTOBJ0_EID_POSITION                0x0000000B
#define _CFD3FLTOBJ0_EID_MASK                    0x1FFFF800
#define _CFD3FLTOBJ0_EID_LENGTH                  0x00000012

#define _CFD3FLTOBJ0_SID11_POSITION              0x0000001D
#define _CFD3FLTOBJ0_SID11_MASK                  0x20000000
#define _CFD3FLTOBJ0_SID11_LENGTH                0x00000001

#define _CFD3FLTOBJ0_EXIDE_POSITION              0x0000001E
#define _CFD3FLTOBJ0_EXIDE_MASK                  0x40000000
#define _CFD3FLTOBJ0_EXIDE_LENGTH                0x00000001

#define _CFD3MASK0_MSID_POSITION                 0x00000000
#define _CFD3MASK0_MSID_MASK                     0x000007FF
#define _CFD3MASK0_MSID_LENGTH                   0x0000000B

