Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD3FLTOBJ14_SID_POSITION               0x00000000
#define _CFD3FLTOBJ14_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ14_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ14_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ14_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ14_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ14_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ14_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ14_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ14_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ14_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ14_EXIDE_LENGTH               0x00000001

#define _CFD3MASK14_MSID_POSITION                0x00000000
#define _CFD3MASK14_MSID_MASK                    0x000007FF
#define _CFD3MASK14_MSID_LENGTH                  0x0000000B

#define _CFD3MASK14_MEID_POSITION                0x0000000B
#define _CFD3MASK14_MEID_MASK                    0x1FFFF800
#define _CFD3MASK14_MEID_LENGTH                  0x00000012

#define _CFD3MASK14_MSID11_POSITION              0x0000001D
#define _CFD3MASK14_MSID11_MASK                  0x20000000
#define _CFD3MASK14_MSID11_LENGTH                0x00000001

#define _CFD3MASK14_MIDE_POSITION                0x0000001E
#define _CFD3MASK14_MIDE_MASK                    0x40000000
#define _CFD3MASK14_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ15_SID_POSITION               0x00000000
#define _CFD3FLTOBJ15_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ15_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ15_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ15_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ15_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ15_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ15_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ15_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ15_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ15_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ15_EXIDE_LENGTH               0x00000001

#define _CFD3MASK15_MSID_POSITION                0x00000000
#define _CFD3MASK15_MSID_MASK                    0x000007FF
#define _CFD3MASK15_MSID_LENGTH                  0x0000000B

#define _CFD3MASK15_MEID_POSITION                0x0000000B
#define _CFD3MASK15_MEID_MASK                    0x1FFFF800
#define _CFD3MASK15_MEID_LENGTH                  0x00000012

#define _CFD3MASK15_MSID11_POSITION              0x0000001D
#define _CFD3MASK15_MSID11_MASK                  0x20000000
#define _CFD3MASK15_MSID11_LENGTH                0x00000001

#define _CFD3MASK15_MIDE_POSITION                0x0000001E
#define _CFD3MASK15_MIDE_MASK                    0x40000000
#define _CFD3MASK15_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ16_SID_POSITION               0x00000000
#define _CFD3FLTOBJ16_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ16_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ16_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ16_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ16_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ16_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ16_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ16_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ16_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ16_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ16_EXIDE_LENGTH               0x00000001

#define _CFD3MASK16_MSID_POSITION                0x00000000
#define _CFD3MASK16_MSID_MASK                    0x000007FF
#define _CFD3MASK16_MSID_LENGTH                  0x0000000B

#define _CFD3MASK16_MEID_POSITION                0x0000000B
#define _CFD3MASK16_MEID_MASK                    0x1FFFF800
#define _CFD3MASK16_MEID_LENGTH                  0x00000012

#define _CFD3MASK16_MSID11_POSITION              0x0000001D
#define _CFD3MASK16_MSID11_MASK                  0x20000000
#define _CFD3MASK16_MSID11_LENGTH                0x00000001

#define _CFD3MASK16_MIDE_POSITION                0x0000001E
#define _CFD3MASK16_MIDE_MASK                    0x40000000
#define _CFD3MASK16_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ17_SID_POSITION               0x00000000
#define _CFD3FLTOBJ17_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ17_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ17_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ17_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ17_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ17_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ17_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ17_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ17_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ17_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ17_EXIDE_LENGTH               0x00000001

#define _CFD3MASK17_MSID_POSITION                0x00000000
#define _CFD3MASK17_MSID_MASK                    0x000007FF
#define _CFD3MASK17_MSID_LENGTH                  0x0000000B

#define _CFD3MASK17_MEID_POSITION                0x0000000B
#define _CFD3MASK17_MEID_MASK                    0x1FFFF800
#define _CFD3MASK17_MEID_LENGTH                  0x00000012

#define _CFD3MASK17_MSID11_POSITION              0x0000001D
#define _CFD3MASK17_MSID11_MASK                  0x20000000
#define _CFD3MASK17_MSID11_LENGTH                0x00000001

#define _CFD3MASK17_MIDE_POSITION                0x0000001E
#define _CFD3MASK17_MIDE_MASK                    0x40000000
#define _CFD3MASK17_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ18_SID_POSITION               0x00000000
#define _CFD3FLTOBJ18_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ18_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ18_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ18_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ18_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ18_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ18_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ18_SID11_LENGTH               0x00000001

