Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD3FLTOBJ18_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ18_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ18_EXIDE_LENGTH               0x00000001

#define _CFD3MASK18_MSID_POSITION                0x00000000
#define _CFD3MASK18_MSID_MASK                    0x000007FF
#define _CFD3MASK18_MSID_LENGTH                  0x0000000B

#define _CFD3MASK18_MEID_POSITION                0x0000000B
#define _CFD3MASK18_MEID_MASK                    0x1FFFF800
#define _CFD3MASK18_MEID_LENGTH                  0x00000012

#define _CFD3MASK18_MSID11_POSITION              0x0000001D
#define _CFD3MASK18_MSID11_MASK                  0x20000000
#define _CFD3MASK18_MSID11_LENGTH                0x00000001

#define _CFD3MASK18_MIDE_POSITION                0x0000001E
#define _CFD3MASK18_MIDE_MASK                    0x40000000
#define _CFD3MASK18_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ19_SID_POSITION               0x00000000
#define _CFD3FLTOBJ19_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ19_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ19_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ19_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ19_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ19_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ19_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ19_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ19_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ19_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ19_EXIDE_LENGTH               0x00000001

#define _CFD3MASK19_MSID_POSITION                0x00000000
#define _CFD3MASK19_MSID_MASK                    0x000007FF
#define _CFD3MASK19_MSID_LENGTH                  0x0000000B

#define _CFD3MASK19_MEID_POSITION                0x0000000B
#define _CFD3MASK19_MEID_MASK                    0x1FFFF800
#define _CFD3MASK19_MEID_LENGTH                  0x00000012

#define _CFD3MASK19_MSID11_POSITION              0x0000001D
#define _CFD3MASK19_MSID11_MASK                  0x20000000
#define _CFD3MASK19_MSID11_LENGTH                0x00000001

#define _CFD3MASK19_MIDE_POSITION                0x0000001E
#define _CFD3MASK19_MIDE_MASK                    0x40000000
#define _CFD3MASK19_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ20_SID_POSITION               0x00000000
#define _CFD3FLTOBJ20_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ20_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ20_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ20_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ20_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ20_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ20_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ20_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ20_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ20_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ20_EXIDE_LENGTH               0x00000001

#define _CFD3MASK20_MSID_POSITION                0x00000000
#define _CFD3MASK20_MSID_MASK                    0x000007FF
#define _CFD3MASK20_MSID_LENGTH                  0x0000000B

#define _CFD3MASK20_MEID_POSITION                0x0000000B
#define _CFD3MASK20_MEID_MASK                    0x1FFFF800
#define _CFD3MASK20_MEID_LENGTH                  0x00000012

#define _CFD3MASK20_MSID11_POSITION              0x0000001D
#define _CFD3MASK20_MSID11_MASK                  0x20000000
#define _CFD3MASK20_MSID11_LENGTH                0x00000001

#define _CFD3MASK20_MIDE_POSITION                0x0000001E
#define _CFD3MASK20_MIDE_MASK                    0x40000000
#define _CFD3MASK20_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ21_SID_POSITION               0x00000000
#define _CFD3FLTOBJ21_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ21_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ21_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ21_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ21_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ21_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ21_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ21_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ21_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ21_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ21_EXIDE_LENGTH               0x00000001

#define _CFD3MASK21_MSID_POSITION                0x00000000
#define _CFD3MASK21_MSID_MASK                    0x000007FF
#define _CFD3MASK21_MSID_LENGTH                  0x0000000B

#define _CFD3MASK21_MEID_POSITION                0x0000000B
#define _CFD3MASK21_MEID_MASK                    0x1FFFF800
#define _CFD3MASK21_MEID_LENGTH                  0x00000012

#define _CFD3MASK21_MSID11_POSITION              0x0000001D
#define _CFD3MASK21_MSID11_MASK                  0x20000000
#define _CFD3MASK21_MSID11_LENGTH                0x00000001

#define _CFD3MASK21_MIDE_POSITION                0x0000001E
#define _CFD3MASK21_MIDE_MASK                    0x40000000
#define _CFD3MASK21_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ22_SID_POSITION               0x00000000
#define _CFD3FLTOBJ22_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ22_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ22_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ22_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ22_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ22_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ22_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ22_SID11_LENGTH               0x00000001

#define _CFD3FLTOBJ22_EXIDE_POSITION             0x0000001E
#define _CFD3FLTOBJ22_EXIDE_MASK                 0x40000000
#define _CFD3FLTOBJ22_EXIDE_LENGTH               0x00000001

#define _CFD3MASK22_MSID_POSITION                0x00000000
#define _CFD3MASK22_MSID_MASK                    0x000007FF
#define _CFD3MASK22_MSID_LENGTH                  0x0000000B

#define _CFD3MASK22_MEID_POSITION                0x0000000B
#define _CFD3MASK22_MEID_MASK                    0x1FFFF800
#define _CFD3MASK22_MEID_LENGTH                  0x00000012

#define _CFD3MASK22_MSID11_POSITION              0x0000001D
#define _CFD3MASK22_MSID11_MASK                  0x20000000
#define _CFD3MASK22_MSID11_LENGTH                0x00000001

#define _CFD3MASK22_MIDE_POSITION                0x0000001E
#define _CFD3MASK22_MIDE_MASK                    0x40000000
#define _CFD3MASK22_MIDE_LENGTH                  0x00000001

#define _CFD3FLTOBJ23_SID_POSITION               0x00000000
#define _CFD3FLTOBJ23_SID_MASK                   0x000007FF
#define _CFD3FLTOBJ23_SID_LENGTH                 0x0000000B

#define _CFD3FLTOBJ23_EID_POSITION               0x0000000B
#define _CFD3FLTOBJ23_EID_MASK                   0x1FFFF800
#define _CFD3FLTOBJ23_EID_LENGTH                 0x00000012

#define _CFD3FLTOBJ23_SID11_POSITION             0x0000001D
#define _CFD3FLTOBJ23_SID11_MASK                 0x20000000
#define _CFD3FLTOBJ23_SID11_LENGTH               0x00000001

