Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _CFD4FLTOBJ26_SID_POSITION               0x00000000
#define _CFD4FLTOBJ26_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ26_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ26_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ26_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ26_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ26_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ26_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ26_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ26_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ26_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ26_EXIDE_LENGTH               0x00000001

#define _CFD4MASK26_MSID_POSITION                0x00000000
#define _CFD4MASK26_MSID_MASK                    0x000007FF
#define _CFD4MASK26_MSID_LENGTH                  0x0000000B

#define _CFD4MASK26_MEID_POSITION                0x0000000B
#define _CFD4MASK26_MEID_MASK                    0x1FFFF800
#define _CFD4MASK26_MEID_LENGTH                  0x00000012

#define _CFD4MASK26_MSID11_POSITION              0x0000001D
#define _CFD4MASK26_MSID11_MASK                  0x20000000
#define _CFD4MASK26_MSID11_LENGTH                0x00000001

#define _CFD4MASK26_MIDE_POSITION                0x0000001E
#define _CFD4MASK26_MIDE_MASK                    0x40000000
#define _CFD4MASK26_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ27_SID_POSITION               0x00000000
#define _CFD4FLTOBJ27_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ27_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ27_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ27_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ27_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ27_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ27_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ27_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ27_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ27_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ27_EXIDE_LENGTH               0x00000001

#define _CFD4MASK27_MSID_POSITION                0x00000000
#define _CFD4MASK27_MSID_MASK                    0x000007FF
#define _CFD4MASK27_MSID_LENGTH                  0x0000000B

#define _CFD4MASK27_MEID_POSITION                0x0000000B
#define _CFD4MASK27_MEID_MASK                    0x1FFFF800
#define _CFD4MASK27_MEID_LENGTH                  0x00000012

#define _CFD4MASK27_MSID11_POSITION              0x0000001D
#define _CFD4MASK27_MSID11_MASK                  0x20000000
#define _CFD4MASK27_MSID11_LENGTH                0x00000001

#define _CFD4MASK27_MIDE_POSITION                0x0000001E
#define _CFD4MASK27_MIDE_MASK                    0x40000000
#define _CFD4MASK27_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ28_SID_POSITION               0x00000000
#define _CFD4FLTOBJ28_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ28_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ28_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ28_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ28_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ28_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ28_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ28_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ28_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ28_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ28_EXIDE_LENGTH               0x00000001

#define _CFD4MASK28_MSID_POSITION                0x00000000
#define _CFD4MASK28_MSID_MASK                    0x000007FF
#define _CFD4MASK28_MSID_LENGTH                  0x0000000B

#define _CFD4MASK28_MEID_POSITION                0x0000000B
#define _CFD4MASK28_MEID_MASK                    0x1FFFF800
#define _CFD4MASK28_MEID_LENGTH                  0x00000012

#define _CFD4MASK28_MSID11_POSITION              0x0000001D
#define _CFD4MASK28_MSID11_MASK                  0x20000000
#define _CFD4MASK28_MSID11_LENGTH                0x00000001

#define _CFD4MASK28_MIDE_POSITION                0x0000001E
#define _CFD4MASK28_MIDE_MASK                    0x40000000
#define _CFD4MASK28_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ29_SID_POSITION               0x00000000
#define _CFD4FLTOBJ29_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ29_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ29_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ29_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ29_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ29_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ29_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ29_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ29_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ29_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ29_EXIDE_LENGTH               0x00000001

#define _CFD4MASK29_MSID_POSITION                0x00000000
#define _CFD4MASK29_MSID_MASK                    0x000007FF
#define _CFD4MASK29_MSID_LENGTH                  0x0000000B

#define _CFD4MASK29_MEID_POSITION                0x0000000B
#define _CFD4MASK29_MEID_MASK                    0x1FFFF800
#define _CFD4MASK29_MEID_LENGTH                  0x00000012

#define _CFD4MASK29_MSID11_POSITION              0x0000001D
#define _CFD4MASK29_MSID11_MASK                  0x20000000
#define _CFD4MASK29_MSID11_LENGTH                0x00000001

#define _CFD4MASK29_MIDE_POSITION                0x0000001E
#define _CFD4MASK29_MIDE_MASK                    0x40000000
#define _CFD4MASK29_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ30_SID_POSITION               0x00000000
#define _CFD4FLTOBJ30_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ30_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ30_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ30_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ30_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ30_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ30_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ30_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ30_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ30_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ30_EXIDE_LENGTH               0x00000001

#define _CFD4MASK30_MSID_POSITION                0x00000000
#define _CFD4MASK30_MSID_MASK                    0x000007FF
#define _CFD4MASK30_MSID_LENGTH                  0x0000000B

