Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _ADC4TIME_BCHEN_POSITION                 0x00000017
#define _ADC4TIME_BCHEN_MASK                     0x00800000
#define _ADC4TIME_BCHEN_LENGTH                   0x00000001

#define _ADC4TIME_SELRES_POSITION                0x00000018
#define _ADC4TIME_SELRES_MASK                    0x03000000
#define _ADC4TIME_SELRES_LENGTH                  0x00000002

#define _ADC4TIME_ADCEIS_POSITION                0x0000001A
#define _ADC4TIME_ADCEIS_MASK                    0x1C000000
#define _ADC4TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC5TIME_SAMC_POSITION                  0x00000000
#define _ADC5TIME_SAMC_MASK                      0x000003FF
#define _ADC5TIME_SAMC_LENGTH                    0x0000000A

#define _ADC5TIME_ADCDIV_POSITION                0x00000010
#define _ADC5TIME_ADCDIV_MASK                    0x007F0000
#define _ADC5TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC5TIME_BCHEN_POSITION                 0x00000017
#define _ADC5TIME_BCHEN_MASK                     0x00800000
#define _ADC5TIME_BCHEN_LENGTH                   0x00000001

#define _ADC5TIME_SELRES_POSITION                0x00000018
#define _ADC5TIME_SELRES_MASK                    0x03000000
#define _ADC5TIME_SELRES_LENGTH                  0x00000002

#define _ADC5TIME_ADCEIS_POSITION                0x0000001A
#define _ADC5TIME_ADCEIS_MASK                    0x1C000000
#define _ADC5TIME_ADCEIS_LENGTH                  0x00000003

#define _ADCEIEN1_EIEN0_POSITION                 0x00000000
#define _ADCEIEN1_EIEN0_MASK                     0x00000001
#define _ADCEIEN1_EIEN0_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN1_POSITION                 0x00000001
#define _ADCEIEN1_EIEN1_MASK                     0x00000002
#define _ADCEIEN1_EIEN1_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN2_POSITION                 0x00000002
#define _ADCEIEN1_EIEN2_MASK                     0x00000004
#define _ADCEIEN1_EIEN2_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN3_POSITION                 0x00000003
#define _ADCEIEN1_EIEN3_MASK                     0x00000008
#define _ADCEIEN1_EIEN3_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN4_POSITION                 0x00000004
#define _ADCEIEN1_EIEN4_MASK                     0x00000010
#define _ADCEIEN1_EIEN4_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN5_POSITION                 0x00000005
#define _ADCEIEN1_EIEN5_MASK                     0x00000020
#define _ADCEIEN1_EIEN5_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN6_POSITION                 0x00000006
#define _ADCEIEN1_EIEN6_MASK                     0x00000040
#define _ADCEIEN1_EIEN6_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN7_POSITION                 0x00000007
#define _ADCEIEN1_EIEN7_MASK                     0x00000080
#define _ADCEIEN1_EIEN7_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN8_POSITION                 0x00000008
#define _ADCEIEN1_EIEN8_MASK                     0x00000100
#define _ADCEIEN1_EIEN8_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN9_POSITION                 0x00000009
#define _ADCEIEN1_EIEN9_MASK                     0x00000200
#define _ADCEIEN1_EIEN9_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN10_POSITION                0x0000000A
#define _ADCEIEN1_EIEN10_MASK                    0x00000400
#define _ADCEIEN1_EIEN10_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN11_POSITION                0x0000000B
#define _ADCEIEN1_EIEN11_MASK                    0x00000800
#define _ADCEIEN1_EIEN11_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN12_POSITION                0x0000000C
#define _ADCEIEN1_EIEN12_MASK                    0x00001000
#define _ADCEIEN1_EIEN12_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN13_POSITION                0x0000000D
#define _ADCEIEN1_EIEN13_MASK                    0x00002000
#define _ADCEIEN1_EIEN13_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN14_POSITION                0x0000000E
#define _ADCEIEN1_EIEN14_MASK                    0x00004000
#define _ADCEIEN1_EIEN14_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN15_POSITION                0x0000000F
#define _ADCEIEN1_EIEN15_MASK                    0x00008000
#define _ADCEIEN1_EIEN15_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN16_POSITION                0x00000010
#define _ADCEIEN1_EIEN16_MASK                    0x00010000
#define _ADCEIEN1_EIEN16_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN17_POSITION                0x00000011
#define _ADCEIEN1_EIEN17_MASK                    0x00020000
#define _ADCEIEN1_EIEN17_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN18_POSITION                0x00000012
#define _ADCEIEN1_EIEN18_MASK                    0x00040000
#define _ADCEIEN1_EIEN18_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN19_POSITION                0x00000013
#define _ADCEIEN1_EIEN19_MASK                    0x00080000
#define _ADCEIEN1_EIEN19_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN20_POSITION                0x00000014
#define _ADCEIEN1_EIEN20_MASK                    0x00100000
#define _ADCEIEN1_EIEN20_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN21_POSITION                0x00000015
#define _ADCEIEN1_EIEN21_MASK                    0x00200000
#define _ADCEIEN1_EIEN21_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN22_POSITION                0x00000016
#define _ADCEIEN1_EIEN22_MASK                    0x00400000
#define _ADCEIEN1_EIEN22_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN23_POSITION                0x00000017
#define _ADCEIEN1_EIEN23_MASK                    0x00800000
#define _ADCEIEN1_EIEN23_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN24_POSITION                0x00000018
#define _ADCEIEN1_EIEN24_MASK                    0x01000000
#define _ADCEIEN1_EIEN24_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN25_POSITION                0x00000019
#define _ADCEIEN1_EIEN25_MASK                    0x02000000
#define _ADCEIEN1_EIEN25_LENGTH                  0x00000001

