Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _SBT3WR0_GROUP2_POSITION                 0x00000002
#define _SBT3WR0_GROUP2_MASK                     0x00000004
#define _SBT3WR0_GROUP2_LENGTH                   0x00000001

#define _SBT3WR0_GROUP3_POSITION                 0x00000003
#define _SBT3WR0_GROUP3_MASK                     0x00000008
#define _SBT3WR0_GROUP3_LENGTH                   0x00000001

#define _SBT3REG1_SIZE_POSITION                  0x00000003
#define _SBT3REG1_SIZE_MASK                      0x000000F8
#define _SBT3REG1_SIZE_LENGTH                    0x00000005

#define _SBT3REG1_PRI_POSITION                   0x00000009
#define _SBT3REG1_PRI_MASK                       0x00000200
#define _SBT3REG1_PRI_LENGTH                     0x00000001

#define _SBT3REG1_BASE_POSITION                  0x0000000A
#define _SBT3REG1_BASE_MASK                      0xFFFFFC00
#define _SBT3REG1_BASE_LENGTH                    0x00000016

#define _SBT3RD1_GROUP0_POSITION                 0x00000000
#define _SBT3RD1_GROUP0_MASK                     0x00000001
#define _SBT3RD1_GROUP0_LENGTH                   0x00000001

#define _SBT3RD1_GROUP1_POSITION                 0x00000001
#define _SBT3RD1_GROUP1_MASK                     0x00000002
#define _SBT3RD1_GROUP1_LENGTH                   0x00000001

#define _SBT3RD1_GROUP2_POSITION                 0x00000002
#define _SBT3RD1_GROUP2_MASK                     0x00000004
#define _SBT3RD1_GROUP2_LENGTH                   0x00000001

#define _SBT3RD1_GROUP3_POSITION                 0x00000003
#define _SBT3RD1_GROUP3_MASK                     0x00000008
#define _SBT3RD1_GROUP3_LENGTH                   0x00000001

#define _SBT3WR1_GROUP0_POSITION                 0x00000000
#define _SBT3WR1_GROUP0_MASK                     0x00000001
#define _SBT3WR1_GROUP0_LENGTH                   0x00000001

#define _SBT3WR1_GROUP1_POSITION                 0x00000001
#define _SBT3WR1_GROUP1_MASK                     0x00000002
#define _SBT3WR1_GROUP1_LENGTH                   0x00000001

#define _SBT3WR1_GROUP2_POSITION                 0x00000002
#define _SBT3WR1_GROUP2_MASK                     0x00000004
#define _SBT3WR1_GROUP2_LENGTH                   0x00000001

#define _SBT3WR1_GROUP3_POSITION                 0x00000003
#define _SBT3WR1_GROUP3_MASK                     0x00000008
#define _SBT3WR1_GROUP3_LENGTH                   0x00000001

#define _SBT3REG2_SIZE_POSITION                  0x00000003
#define _SBT3REG2_SIZE_MASK                      0x000000F8
#define _SBT3REG2_SIZE_LENGTH                    0x00000005

#define _SBT3REG2_PRI_POSITION                   0x00000009
#define _SBT3REG2_PRI_MASK                       0x00000200
#define _SBT3REG2_PRI_LENGTH                     0x00000001

#define _SBT3REG2_BASE_POSITION                  0x0000000A
#define _SBT3REG2_BASE_MASK                      0xFFFFFC00
#define _SBT3REG2_BASE_LENGTH                    0x00000016

#define _SBT3RD2_GROUP0_POSITION                 0x00000000
#define _SBT3RD2_GROUP0_MASK                     0x00000001
#define _SBT3RD2_GROUP0_LENGTH                   0x00000001

#define _SBT3RD2_GROUP1_POSITION                 0x00000001
#define _SBT3RD2_GROUP1_MASK                     0x00000002
#define _SBT3RD2_GROUP1_LENGTH                   0x00000001

#define _SBT3RD2_GROUP2_POSITION                 0x00000002
#define _SBT3RD2_GROUP2_MASK                     0x00000004
#define _SBT3RD2_GROUP2_LENGTH                   0x00000001

#define _SBT3RD2_GROUP3_POSITION                 0x00000003
#define _SBT3RD2_GROUP3_MASK                     0x00000008
#define _SBT3RD2_GROUP3_LENGTH                   0x00000001

#define _SBT3WR2_GROUP0_POSITION                 0x00000000
#define _SBT3WR2_GROUP0_MASK                     0x00000001
#define _SBT3WR2_GROUP0_LENGTH                   0x00000001

#define _SBT3WR2_GROUP1_POSITION                 0x00000001
#define _SBT3WR2_GROUP1_MASK                     0x00000002
#define _SBT3WR2_GROUP1_LENGTH                   0x00000001

#define _SBT3WR2_GROUP2_POSITION                 0x00000002
#define _SBT3WR2_GROUP2_MASK                     0x00000004
#define _SBT3WR2_GROUP2_LENGTH                   0x00000001

#define _SBT3WR2_GROUP3_POSITION                 0x00000003
#define _SBT3WR2_GROUP3_MASK                     0x00000008
#define _SBT3WR2_GROUP3_LENGTH                   0x00000001

#define _DEVCFG4_A1DIFFPR_POSITION               0x00000018
#define _DEVCFG4_A1DIFFPR_MASK                   0x03000000
#define _DEVCFG4_A1DIFFPR_LENGTH                 0x00000002

#define _DEVCFG4_A2DIFFPR_POSITION               0x0000001A
#define _DEVCFG4_A2DIFFPR_MASK                   0x0C000000
#define _DEVCFG4_A2DIFFPR_LENGTH                 0x00000002

#define _DEVCFG4_A3DIFFPR_POSITION               0x0000001C
#define _DEVCFG4_A3DIFFPR_MASK                   0x30000000
#define _DEVCFG4_A3DIFFPR_LENGTH                 0x00000002

#define _DEVCFG4_A5DIFFPR_POSITION               0x0000001E
#define _DEVCFG4_A5DIFFPR_MASK                   0xC0000000
#define _DEVCFG4_A5DIFFPR_LENGTH                 0x00000002

#define _DEVCFG4_w_POSITION                      0x00000000
#define _DEVCFG4_w_MASK                          0xFFFFFFFF
#define _DEVCFG4_w_LENGTH                        0x00000020

#define _DEVCFG3_USERID_POSITION                 0x00000000
#define _DEVCFG3_USERID_MASK                     0x0000FFFF
#define _DEVCFG3_USERID_LENGTH                   0x00000010

#define _DEVCFG3_FUSBIDIO2_POSITION              0x00000016
#define _DEVCFG3_FUSBIDIO2_MASK                  0x00400000
#define _DEVCFG3_FUSBIDIO2_LENGTH                0x00000001

#define _DEVCFG3_FVBUSIO2_POSITION               0x00000017
#define _DEVCFG3_FVBUSIO2_MASK                   0x00800000
#define _DEVCFG3_FVBUSIO2_LENGTH                 0x00000001

#define _DEVCFG3_PGL1WAY_POSITION                0x0000001B
#define _DEVCFG3_PGL1WAY_MASK                    0x08000000
#define _DEVCFG3_PGL1WAY_LENGTH                  0x00000001

#define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C
#define _DEVCFG3_PMDL1WAY_MASK                   0x10000000
#define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001

