Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk1024gpl100.h
#define _ADEVCFG0_DEBUG_POSITION                 0x00000000
#define _ADEVCFG0_DEBUG_MASK                     0x00000003
#define _ADEVCFG0_DEBUG_LENGTH                   0x00000002

#define _ADEVCFG0_JTAGEN_POSITION                0x00000002
#define _ADEVCFG0_JTAGEN_MASK                    0x00000004
#define _ADEVCFG0_JTAGEN_LENGTH                  0x00000001

#define _ADEVCFG0_ICESEL_POSITION                0x00000003
#define _ADEVCFG0_ICESEL_MASK                    0x00000018
#define _ADEVCFG0_ICESEL_LENGTH                  0x00000002

#define _ADEVCFG0_TRCEN_POSITION                 0x00000005
#define _ADEVCFG0_TRCEN_MASK                     0x00000020
#define _ADEVCFG0_TRCEN_LENGTH                   0x00000001

#define _ADEVCFG0_BOOTISA_POSITION               0x00000006
#define _ADEVCFG0_BOOTISA_MASK                   0x00000040
#define _ADEVCFG0_BOOTISA_LENGTH                 0x00000001

#define _ADEVCFG0_FECCCON_POSITION               0x00000008
#define _ADEVCFG0_FECCCON_MASK                   0x00000300
#define _ADEVCFG0_FECCCON_LENGTH                 0x00000002

#define _ADEVCFG0_FSLEEP_POSITION                0x0000000A
#define _ADEVCFG0_FSLEEP_MASK                    0x00000400
#define _ADEVCFG0_FSLEEP_LENGTH                  0x00000001

#define _ADEVCFG0_DBGPER_POSITION                0x0000000C
#define _ADEVCFG0_DBGPER_MASK                    0x00007000
#define _ADEVCFG0_DBGPER_LENGTH                  0x00000003

#define _ADEVCFG0_SMCLR_POSITION                 0x0000000F
#define _ADEVCFG0_SMCLR_MASK                     0x00008000
#define _ADEVCFG0_SMCLR_LENGTH                   0x00000001

#define _ADEVCFG0_SOSCGAIN_POSITION              0x00000010
#define _ADEVCFG0_SOSCGAIN_MASK                  0x00030000
#define _ADEVCFG0_SOSCGAIN_LENGTH                0x00000002

#define _ADEVCFG0_SOSCBOOST_POSITION             0x00000012
#define _ADEVCFG0_SOSCBOOST_MASK                 0x00040000
#define _ADEVCFG0_SOSCBOOST_LENGTH               0x00000001

#define _ADEVCFG0_POSCGAIN_POSITION              0x00000013
#define _ADEVCFG0_POSCGAIN_MASK                  0x00180000
#define _ADEVCFG0_POSCGAIN_LENGTH                0x00000002

#define _ADEVCFG0_POSCBOOST_POSITION             0x00000015
#define _ADEVCFG0_POSCBOOST_MASK                 0x00200000
#define _ADEVCFG0_POSCBOOST_LENGTH               0x00000001

#define _ADEVCFG0_POSCFGAIN_POSITION             0x00000016
#define _ADEVCFG0_POSCFGAIN_MASK                 0x00C00000
#define _ADEVCFG0_POSCFGAIN_LENGTH               0x00000002

#define _ADEVCFG0_POSCAGCDLY_POSITION            0x00000018
#define _ADEVCFG0_POSCAGCDLY_MASK                0x03000000
#define _ADEVCFG0_POSCAGCDLY_LENGTH              0x00000002

#define _ADEVCFG0_POSCAGCRNG_POSITION            0x0000001A
#define _ADEVCFG0_POSCAGCRNG_MASK                0x04000000
#define _ADEVCFG0_POSCAGCRNG_LENGTH              0x00000001

#define _ADEVCFG0_POSCAGC_POSITION               0x0000001B
#define _ADEVCFG0_POSCAGC_MASK                   0x08000000
#define _ADEVCFG0_POSCAGC_LENGTH                 0x00000001

#define _ADEVCFG0_EJTAGBEN_POSITION              0x0000001E
#define _ADEVCFG0_EJTAGBEN_MASK                  0x40000000
#define _ADEVCFG0_EJTAGBEN_LENGTH                0x00000001

#define _ADEVCFG0_FDEBUG_POSITION                0x00000000
#define _ADEVCFG0_FDEBUG_MASK                    0x00000003
#define _ADEVCFG0_FDEBUG_LENGTH                  0x00000002

#define _ADEVCFG0_w_POSITION                     0x00000000
#define _ADEVCFG0_w_MASK                         0xFFFFFFFF
#define _ADEVCFG0_w_LENGTH                       0x00000020

#define _ADEVCP_CP_POSITION                      0x0000001C
#define _ADEVCP_CP_MASK                          0x10000000
#define _ADEVCP_CP_LENGTH                        0x00000001

#define _ADEVCP_w_POSITION                       0x00000000
#define _ADEVCP_w_MASK                           0xFFFFFFFF
#define _ADEVCP_w_LENGTH                         0x00000020

#define _ASEQ_TSEQ_POSITION                      0x00000000
#define _ASEQ_TSEQ_MASK                          0x0000FFFF
#define _ASEQ_TSEQ_LENGTH                        0x00000010

#define _ASEQ_CSEQ_POSITION                      0x00000010
#define _ASEQ_CSEQ_MASK                          0xFFFF0000
#define _ASEQ_CSEQ_LENGTH                        0x00000010

#define _ASEQ_w_POSITION                         0x00000000
#define _ASEQ_w_MASK                             0xFFFFFFFF
#define _ASEQ_w_LENGTH                           0x00000020

#define _AUBADEVCFG4_A1DIFFPR_POSITION           0x00000018
#define _AUBADEVCFG4_A1DIFFPR_MASK               0x03000000
#define _AUBADEVCFG4_A1DIFFPR_LENGTH             0x00000002

#define _AUBADEVCFG4_A2DIFFPR_POSITION           0x0000001A
#define _AUBADEVCFG4_A2DIFFPR_MASK               0x0C000000
#define _AUBADEVCFG4_A2DIFFPR_LENGTH             0x00000002

#define _AUBADEVCFG4_A3DIFFPR_POSITION           0x0000001C
#define _AUBADEVCFG4_A3DIFFPR_MASK               0x30000000
#define _AUBADEVCFG4_A3DIFFPR_LENGTH             0x00000002

#define _AUBADEVCFG4_A5DIFFPR_POSITION           0x0000001E
#define _AUBADEVCFG4_A5DIFFPR_MASK               0xC0000000
#define _AUBADEVCFG4_A5DIFFPR_LENGTH             0x00000002

#define _AUBADEVCFG4_w_POSITION                  0x00000000
#define _AUBADEVCFG4_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG4_w_LENGTH                    0x00000020

#define _AUBADEVCFG3_USERID_POSITION             0x00000000
#define _AUBADEVCFG3_USERID_MASK                 0x0000FFFF
#define _AUBADEVCFG3_USERID_LENGTH               0x00000010

#define _AUBADEVCFG3_FUSBIDIO2_POSITION          0x00000016
#define _AUBADEVCFG3_FUSBIDIO2_MASK              0x00400000
#define _AUBADEVCFG3_FUSBIDIO2_LENGTH            0x00000001

#define _AUBADEVCFG3_FVBUSIO2_POSITION           0x00000017
#define _AUBADEVCFG3_FVBUSIO2_MASK               0x00800000
#define _AUBADEVCFG3_FVBUSIO2_LENGTH             0x00000001

#define _AUBADEVCFG3_PGL1WAY_POSITION            0x0000001B
#define _AUBADEVCFG3_PGL1WAY_MASK                0x08000000
#define _AUBADEVCFG3_PGL1WAY_LENGTH              0x00000001

